analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/sdhc_regs.h
#define MXC_F_SDHC_PRESENT_CARD_STATE_POS              17 /**< PRESENT_CARD_STATE Position */
#define MXC_F_SDHC_PRESENT_CARD_STATE                  ((uint32_t)(0x1UL << MXC_F_SDHC_PRESENT_CARD_STATE_POS)) /**< PRESENT_CARD_STATE Mask */

#define MXC_F_SDHC_PRESENT_CARD_DETECT_POS             18 /**< PRESENT_CARD_DETECT Position */
#define MXC_F_SDHC_PRESENT_CARD_DETECT                 ((uint32_t)(0x1UL << MXC_F_SDHC_PRESENT_CARD_DETECT_POS)) /**< PRESENT_CARD_DETECT Mask */

#define MXC_F_SDHC_PRESENT_WP_POS                      19 /**< PRESENT_WP Position */
#define MXC_F_SDHC_PRESENT_WP                          ((uint32_t)(0x1UL << MXC_F_SDHC_PRESENT_WP_POS)) /**< PRESENT_WP Mask */

#define MXC_F_SDHC_PRESENT_DAT_SIGNAL_LEVEL_POS        20 /**< PRESENT_DAT_SIGNAL_LEVEL Position */
#define MXC_F_SDHC_PRESENT_DAT_SIGNAL_LEVEL            ((uint32_t)(0xFUL << MXC_F_SDHC_PRESENT_DAT_SIGNAL_LEVEL_POS)) /**< PRESENT_DAT_SIGNAL_LEVEL Mask */

#define MXC_F_SDHC_PRESENT_CMD_SIGNAL_LEVEL_POS        24 /**< PRESENT_CMD_SIGNAL_LEVEL Position */
#define MXC_F_SDHC_PRESENT_CMD_SIGNAL_LEVEL            ((uint32_t)(0x1UL << MXC_F_SDHC_PRESENT_CMD_SIGNAL_LEVEL_POS)) /**< PRESENT_CMD_SIGNAL_LEVEL Mask */

/**@} end of group SDHC_PRESENT_Register */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_HOST_CN_1 SDHC_HOST_CN_1
 * @brief    Host Control 1.
 * @{
 */
#define MXC_F_SDHC_HOST_CN_1_LED_CN_POS                0 /**< HOST_CN_1_LED_CN Position */
#define MXC_F_SDHC_HOST_CN_1_LED_CN                    ((uint8_t)(0x1UL << MXC_F_SDHC_HOST_CN_1_LED_CN_POS)) /**< HOST_CN_1_LED_CN Mask */

#define MXC_F_SDHC_HOST_CN_1_DATA_TRANSFER_WIDTH_POS   1 /**< HOST_CN_1_DATA_TRANSFER_WIDTH Position */
#define MXC_F_SDHC_HOST_CN_1_DATA_TRANSFER_WIDTH       ((uint8_t)(0x1UL << MXC_F_SDHC_HOST_CN_1_DATA_TRANSFER_WIDTH_POS)) /**< HOST_CN_1_DATA_TRANSFER_WIDTH Mask */

#define MXC_F_SDHC_HOST_CN_1_HS_EN_POS                 2 /**< HOST_CN_1_HS_EN Position */
#define MXC_F_SDHC_HOST_CN_1_HS_EN                     ((uint8_t)(0x1UL << MXC_F_SDHC_HOST_CN_1_HS_EN_POS)) /**< HOST_CN_1_HS_EN Mask */

#define MXC_F_SDHC_HOST_CN_1_DMA_SELECT_POS            3 /**< HOST_CN_1_DMA_SELECT Position */
#define MXC_F_SDHC_HOST_CN_1_DMA_SELECT                ((uint8_t)(0x3UL << MXC_F_SDHC_HOST_CN_1_DMA_SELECT_POS)) /**< HOST_CN_1_DMA_SELECT Mask */

#define MXC_F_SDHC_HOST_CN_1_EXT_DATA_TRANSFER_WIDTH_POS 5 /**< HOST_CN_1_EXT_DATA_TRANSFER_WIDTH Position */
#define MXC_F_SDHC_HOST_CN_1_EXT_DATA_TRANSFER_WIDTH   ((uint8_t)(0x1UL << MXC_F_SDHC_HOST_CN_1_EXT_DATA_TRANSFER_WIDTH_POS)) /**< HOST_CN_1_EXT_DATA_TRANSFER_WIDTH Mask */

#define MXC_F_SDHC_HOST_CN_1_CARD_DETECT_TEST_POS      6 /**< HOST_CN_1_CARD_DETECT_TEST Position */
#define MXC_F_SDHC_HOST_CN_1_CARD_DETECT_TEST          ((uint8_t)(0x1UL << MXC_F_SDHC_HOST_CN_1_CARD_DETECT_TEST_POS)) /**< HOST_CN_1_CARD_DETECT_TEST Mask */

#define MXC_F_SDHC_HOST_CN_1_CARD_DETECT_SIGNAL_POS    7 /**< HOST_CN_1_CARD_DETECT_SIGNAL Position */
#define MXC_F_SDHC_HOST_CN_1_CARD_DETECT_SIGNAL        ((uint8_t)(0x1UL << MXC_F_SDHC_HOST_CN_1_CARD_DETECT_SIGNAL_POS)) /**< HOST_CN_1_CARD_DETECT_SIGNAL Mask */

/**@} end of group SDHC_HOST_CN_1_Register */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_PWR SDHC_PWR
 * @brief    Power Control.
 * @{
 */
#define MXC_F_SDHC_PWR_BUS_POWER_POS                   0 /**< PWR_BUS_POWER Position */
#define MXC_F_SDHC_PWR_BUS_POWER                       ((uint8_t)(0x1UL << MXC_F_SDHC_PWR_BUS_POWER_POS)) /**< PWR_BUS_POWER Mask */

#define MXC_F_SDHC_PWR_BUS_VOLT_SEL_POS                1 /**< PWR_BUS_VOLT_SEL Position */
#define MXC_F_SDHC_PWR_BUS_VOLT_SEL                    ((uint8_t)(0x7UL << MXC_F_SDHC_PWR_BUS_VOLT_SEL_POS)) /**< PWR_BUS_VOLT_SEL Mask */
#define MXC_V_SDHC_PWR_BUS_VOLT_SEL_1V8_TYP            ((uint8_t)0x5UL) /**< PWR_BUS_VOLT_SEL_1V8_TYP Value */
#define MXC_S_SDHC_PWR_BUS_VOLT_SEL_1V8_TYP            (MXC_V_SDHC_PWR_BUS_VOLT_SEL_1V8_TYP << MXC_F_SDHC_PWR_BUS_VOLT_SEL_POS) /**< PWR_BUS_VOLT_SEL_1V8_TYP Setting */
#define MXC_V_SDHC_PWR_BUS_VOLT_SEL_3V_TYP             ((uint8_t)0x6UL) /**< PWR_BUS_VOLT_SEL_3V_TYP Value */
#define MXC_S_SDHC_PWR_BUS_VOLT_SEL_3V_TYP             (MXC_V_SDHC_PWR_BUS_VOLT_SEL_3V_TYP << MXC_F_SDHC_PWR_BUS_VOLT_SEL_POS) /**< PWR_BUS_VOLT_SEL_3V_TYP Setting */
#define MXC_V_SDHC_PWR_BUS_VOLT_SEL_3V3_TYP            ((uint8_t)0x7UL) /**< PWR_BUS_VOLT_SEL_3V3_TYP Value */
#define MXC_S_SDHC_PWR_BUS_VOLT_SEL_3V3_TYP            (MXC_V_SDHC_PWR_BUS_VOLT_SEL_3V3_TYP << MXC_F_SDHC_PWR_BUS_VOLT_SEL_POS) /**< PWR_BUS_VOLT_SEL_3V3_TYP Setting */

/**@} end of group SDHC_PWR_Register */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_BLK_GAP SDHC_BLK_GAP
 * @brief    Block Gap Control.
 * @{
 */
#define MXC_F_SDHC_BLK_GAP_STOP_POS                    0 /**< BLK_GAP_STOP Position */
#define MXC_F_SDHC_BLK_GAP_STOP                        ((uint8_t)(0x1UL << MXC_F_SDHC_BLK_GAP_STOP_POS)) /**< BLK_GAP_STOP Mask */

#define MXC_F_SDHC_BLK_GAP_CONT_POS                    1 /**< BLK_GAP_CONT Position */
#define MXC_F_SDHC_BLK_GAP_CONT                        ((uint8_t)(0x1UL << MXC_F_SDHC_BLK_GAP_CONT_POS)) /**< BLK_GAP_CONT Mask */

#define MXC_F_SDHC_BLK_GAP_READ_WAIT_POS               2 /**< BLK_GAP_READ_WAIT Position */
#define MXC_F_SDHC_BLK_GAP_READ_WAIT                   ((uint8_t)(0x1UL << MXC_F_SDHC_BLK_GAP_READ_WAIT_POS)) /**< BLK_GAP_READ_WAIT Mask */

#define MXC_F_SDHC_BLK_GAP_INTR_POS                    3 /**< BLK_GAP_INTR Position */
#define MXC_F_SDHC_BLK_GAP_INTR                        ((uint8_t)(0x1UL << MXC_F_SDHC_BLK_GAP_INTR_POS)) /**< BLK_GAP_INTR Mask */

/**@} end of group SDHC_BLK_GAP_Register */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_WAKEUP SDHC_WAKEUP
 * @brief    Wakeup Control.
 * @{
 */
#define MXC_F_SDHC_WAKEUP_CARD_INT_POS                 0 /**< WAKEUP_CARD_INT Position */
#define MXC_F_SDHC_WAKEUP_CARD_INT                     ((uint8_t)(0x1UL << MXC_F_SDHC_WAKEUP_CARD_INT_POS)) /**< WAKEUP_CARD_INT Mask */

#define MXC_F_SDHC_WAKEUP_CARD_INS_POS                 1 /**< WAKEUP_CARD_INS Position */
#define MXC_F_SDHC_WAKEUP_CARD_INS                     ((uint8_t)(0x1UL << MXC_F_SDHC_WAKEUP_CARD_INS_POS)) /**< WAKEUP_CARD_INS Mask */

#define MXC_F_SDHC_WAKEUP_CARD_REM_POS                 2 /**< WAKEUP_CARD_REM Position */
#define MXC_F_SDHC_WAKEUP_CARD_REM                     ((uint8_t)(0x1UL << MXC_F_SDHC_WAKEUP_CARD_REM_POS)) /**< WAKEUP_CARD_REM Mask */

