analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/sdhc_regs.h
/**@} end of group SDHC_WAKEUP_Register */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_CLK_CN SDHC_CLK_CN
 * @brief    Clock Control.
 * @{
 */
#define MXC_F_SDHC_CLK_CN_INTERNAL_CLK_EN_POS          0 /**< CLK_CN_INTERNAL_CLK_EN Position */
#define MXC_F_SDHC_CLK_CN_INTERNAL_CLK_EN              ((uint16_t)(0x1UL << MXC_F_SDHC_CLK_CN_INTERNAL_CLK_EN_POS)) /**< CLK_CN_INTERNAL_CLK_EN Mask */

#define MXC_F_SDHC_CLK_CN_INTERNAL_CLK_STABLE_POS      1 /**< CLK_CN_INTERNAL_CLK_STABLE Position */
#define MXC_F_SDHC_CLK_CN_INTERNAL_CLK_STABLE          ((uint16_t)(0x1UL << MXC_F_SDHC_CLK_CN_INTERNAL_CLK_STABLE_POS)) /**< CLK_CN_INTERNAL_CLK_STABLE Mask */

#define MXC_F_SDHC_CLK_CN_SD_CLK_EN_POS                2 /**< CLK_CN_SD_CLK_EN Position */
#define MXC_F_SDHC_CLK_CN_SD_CLK_EN                    ((uint16_t)(0x1UL << MXC_F_SDHC_CLK_CN_SD_CLK_EN_POS)) /**< CLK_CN_SD_CLK_EN Mask */

#define MXC_F_SDHC_CLK_CN_CLK_GEN_SEL_POS              5 /**< CLK_CN_CLK_GEN_SEL Position */
#define MXC_F_SDHC_CLK_CN_CLK_GEN_SEL                  ((uint16_t)(0x1UL << MXC_F_SDHC_CLK_CN_CLK_GEN_SEL_POS)) /**< CLK_CN_CLK_GEN_SEL Mask */

#define MXC_F_SDHC_CLK_CN_UPPER_SDCLK_FREQ_SEL_POS     6 /**< CLK_CN_UPPER_SDCLK_FREQ_SEL Position */
#define MXC_F_SDHC_CLK_CN_UPPER_SDCLK_FREQ_SEL         ((uint16_t)(0x3UL << MXC_F_SDHC_CLK_CN_UPPER_SDCLK_FREQ_SEL_POS)) /**< CLK_CN_UPPER_SDCLK_FREQ_SEL Mask */

#define MXC_F_SDHC_CLK_CN_SDCLK_FREQ_SEL_POS           8 /**< CLK_CN_SDCLK_FREQ_SEL Position */
#define MXC_F_SDHC_CLK_CN_SDCLK_FREQ_SEL               ((uint16_t)(0xFFUL << MXC_F_SDHC_CLK_CN_SDCLK_FREQ_SEL_POS)) /**< CLK_CN_SDCLK_FREQ_SEL Mask */

/**@} end of group SDHC_CLK_CN_Register */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_TO SDHC_TO
 * @brief    Timeout Control.
 * @{
 */
#define MXC_F_SDHC_TO_DATA_COUNT_VALUE_POS             0 /**< TO_DATA_COUNT_VALUE Position */
#define MXC_F_SDHC_TO_DATA_COUNT_VALUE                 ((uint8_t)(0xFUL << MXC_F_SDHC_TO_DATA_COUNT_VALUE_POS)) /**< TO_DATA_COUNT_VALUE Mask */
#define MXC_V_SDHC_TO_DATA_COUNT_VALUE_2POW13          ((uint8_t)0x0UL) /**< TO_DATA_COUNT_VALUE_2POW13 Value */
#define MXC_S_SDHC_TO_DATA_COUNT_VALUE_2POW13          (MXC_V_SDHC_TO_DATA_COUNT_VALUE_2POW13 << MXC_F_SDHC_TO_DATA_COUNT_VALUE_POS) /**< TO_DATA_COUNT_VALUE_2POW13 Setting */
#define MXC_V_SDHC_TO_DATA_COUNT_VALUE_2POW14          ((uint8_t)0x1UL) /**< TO_DATA_COUNT_VALUE_2POW14 Value */
#define MXC_S_SDHC_TO_DATA_COUNT_VALUE_2POW14          (MXC_V_SDHC_TO_DATA_COUNT_VALUE_2POW14 << MXC_F_SDHC_TO_DATA_COUNT_VALUE_POS) /**< TO_DATA_COUNT_VALUE_2POW14 Setting */
#define MXC_V_SDHC_TO_DATA_COUNT_VALUE_2POW15          ((uint8_t)0x2UL) /**< TO_DATA_COUNT_VALUE_2POW15 Value */
#define MXC_S_SDHC_TO_DATA_COUNT_VALUE_2POW15          (MXC_V_SDHC_TO_DATA_COUNT_VALUE_2POW15 << MXC_F_SDHC_TO_DATA_COUNT_VALUE_POS) /**< TO_DATA_COUNT_VALUE_2POW15 Setting */
#define MXC_V_SDHC_TO_DATA_COUNT_VALUE_2POW16          ((uint8_t)0x3UL) /**< TO_DATA_COUNT_VALUE_2POW16 Value */
#define MXC_S_SDHC_TO_DATA_COUNT_VALUE_2POW16          (MXC_V_SDHC_TO_DATA_COUNT_VALUE_2POW16 << MXC_F_SDHC_TO_DATA_COUNT_VALUE_POS) /**< TO_DATA_COUNT_VALUE_2POW16 Setting */
#define MXC_V_SDHC_TO_DATA_COUNT_VALUE_2POW17          ((uint8_t)0x4UL) /**< TO_DATA_COUNT_VALUE_2POW17 Value */
#define MXC_S_SDHC_TO_DATA_COUNT_VALUE_2POW17          (MXC_V_SDHC_TO_DATA_COUNT_VALUE_2POW17 << MXC_F_SDHC_TO_DATA_COUNT_VALUE_POS) /**< TO_DATA_COUNT_VALUE_2POW17 Setting */
#define MXC_V_SDHC_TO_DATA_COUNT_VALUE_2POW18          ((uint8_t)0x5UL) /**< TO_DATA_COUNT_VALUE_2POW18 Value */
#define MXC_S_SDHC_TO_DATA_COUNT_VALUE_2POW18          (MXC_V_SDHC_TO_DATA_COUNT_VALUE_2POW18 << MXC_F_SDHC_TO_DATA_COUNT_VALUE_POS) /**< TO_DATA_COUNT_VALUE_2POW18 Setting */
#define MXC_V_SDHC_TO_DATA_COUNT_VALUE_2POW19          ((uint8_t)0x6UL) /**< TO_DATA_COUNT_VALUE_2POW19 Value */
#define MXC_S_SDHC_TO_DATA_COUNT_VALUE_2POW19          (MXC_V_SDHC_TO_DATA_COUNT_VALUE_2POW19 << MXC_F_SDHC_TO_DATA_COUNT_VALUE_POS) /**< TO_DATA_COUNT_VALUE_2POW19 Setting */
#define MXC_V_SDHC_TO_DATA_COUNT_VALUE_2POW20          ((uint8_t)0x7UL) /**< TO_DATA_COUNT_VALUE_2POW20 Value */
#define MXC_S_SDHC_TO_DATA_COUNT_VALUE_2POW20          (MXC_V_SDHC_TO_DATA_COUNT_VALUE_2POW20 << MXC_F_SDHC_TO_DATA_COUNT_VALUE_POS) /**< TO_DATA_COUNT_VALUE_2POW20 Setting */
#define MXC_V_SDHC_TO_DATA_COUNT_VALUE_2POW21          ((uint8_t)0x8UL) /**< TO_DATA_COUNT_VALUE_2POW21 Value */
#define MXC_S_SDHC_TO_DATA_COUNT_VALUE_2POW21          (MXC_V_SDHC_TO_DATA_COUNT_VALUE_2POW21 << MXC_F_SDHC_TO_DATA_COUNT_VALUE_POS) /**< TO_DATA_COUNT_VALUE_2POW21 Setting */
#define MXC_V_SDHC_TO_DATA_COUNT_VALUE_2POW22          ((uint8_t)0x9UL) /**< TO_DATA_COUNT_VALUE_2POW22 Value */
#define MXC_S_SDHC_TO_DATA_COUNT_VALUE_2POW22          (MXC_V_SDHC_TO_DATA_COUNT_VALUE_2POW22 << MXC_F_SDHC_TO_DATA_COUNT_VALUE_POS) /**< TO_DATA_COUNT_VALUE_2POW22 Setting */
#define MXC_V_SDHC_TO_DATA_COUNT_VALUE_2POW23          ((uint8_t)0xAUL) /**< TO_DATA_COUNT_VALUE_2POW23 Value */
#define MXC_S_SDHC_TO_DATA_COUNT_VALUE_2POW23          (MXC_V_SDHC_TO_DATA_COUNT_VALUE_2POW23 << MXC_F_SDHC_TO_DATA_COUNT_VALUE_POS) /**< TO_DATA_COUNT_VALUE_2POW23 Setting */
#define MXC_V_SDHC_TO_DATA_COUNT_VALUE_2POW24          ((uint8_t)0xBUL) /**< TO_DATA_COUNT_VALUE_2POW24 Value */
#define MXC_S_SDHC_TO_DATA_COUNT_VALUE_2POW24          (MXC_V_SDHC_TO_DATA_COUNT_VALUE_2POW24 << MXC_F_SDHC_TO_DATA_COUNT_VALUE_POS) /**< TO_DATA_COUNT_VALUE_2POW24 Setting */
#define MXC_V_SDHC_TO_DATA_COUNT_VALUE_2POW25          ((uint8_t)0xCUL) /**< TO_DATA_COUNT_VALUE_2POW25 Value */
#define MXC_S_SDHC_TO_DATA_COUNT_VALUE_2POW25          (MXC_V_SDHC_TO_DATA_COUNT_VALUE_2POW25 << MXC_F_SDHC_TO_DATA_COUNT_VALUE_POS) /**< TO_DATA_COUNT_VALUE_2POW25 Setting */
#define MXC_V_SDHC_TO_DATA_COUNT_VALUE_2POW26          ((uint8_t)0xDUL) /**< TO_DATA_COUNT_VALUE_2POW26 Value */
#define MXC_S_SDHC_TO_DATA_COUNT_VALUE_2POW26          (MXC_V_SDHC_TO_DATA_COUNT_VALUE_2POW26 << MXC_F_SDHC_TO_DATA_COUNT_VALUE_POS) /**< TO_DATA_COUNT_VALUE_2POW26 Setting */
#define MXC_V_SDHC_TO_DATA_COUNT_VALUE_2POW27          ((uint8_t)0xEUL) /**< TO_DATA_COUNT_VALUE_2POW27 Value */
#define MXC_S_SDHC_TO_DATA_COUNT_VALUE_2POW27          (MXC_V_SDHC_TO_DATA_COUNT_VALUE_2POW27 << MXC_F_SDHC_TO_DATA_COUNT_VALUE_POS) /**< TO_DATA_COUNT_VALUE_2POW27 Setting */

