analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/sdhc_regs.h
/**@} end of group SDHC_TO_Register */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_SW_RESET SDHC_SW_RESET
 * @brief    Software Reset.
 * @{
 */
#define MXC_F_SDHC_SW_RESET_RESET_ALL_POS              0 /**< SW_RESET_RESET_ALL Position */
#define MXC_F_SDHC_SW_RESET_RESET_ALL                  ((uint8_t)(0x1UL << MXC_F_SDHC_SW_RESET_RESET_ALL_POS)) /**< SW_RESET_RESET_ALL Mask */

#define MXC_F_SDHC_SW_RESET_RESET_CMD_POS              1 /**< SW_RESET_RESET_CMD Position */
#define MXC_F_SDHC_SW_RESET_RESET_CMD                  ((uint8_t)(0x1UL << MXC_F_SDHC_SW_RESET_RESET_CMD_POS)) /**< SW_RESET_RESET_CMD Mask */

#define MXC_F_SDHC_SW_RESET_RESET_DAT_POS              2 /**< SW_RESET_RESET_DAT Position */
#define MXC_F_SDHC_SW_RESET_RESET_DAT                  ((uint8_t)(0x1UL << MXC_F_SDHC_SW_RESET_RESET_DAT_POS)) /**< SW_RESET_RESET_DAT Mask */

/**@} end of group SDHC_SW_RESET_Register */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_INT_STAT SDHC_INT_STAT
 * @brief    Normal Interrupt Status.
 * @{
 */
#define MXC_F_SDHC_INT_STAT_CMD_COMP_POS               0 /**< INT_STAT_CMD_COMP Position */
#define MXC_F_SDHC_INT_STAT_CMD_COMP                   ((uint16_t)(0x1UL << MXC_F_SDHC_INT_STAT_CMD_COMP_POS)) /**< INT_STAT_CMD_COMP Mask */

#define MXC_F_SDHC_INT_STAT_TRANS_COMP_POS             1 /**< INT_STAT_TRANS_COMP Position */
#define MXC_F_SDHC_INT_STAT_TRANS_COMP                 ((uint16_t)(0x1UL << MXC_F_SDHC_INT_STAT_TRANS_COMP_POS)) /**< INT_STAT_TRANS_COMP Mask */

#define MXC_F_SDHC_INT_STAT_BLK_GAP_EVENT_POS          2 /**< INT_STAT_BLK_GAP_EVENT Position */
#define MXC_F_SDHC_INT_STAT_BLK_GAP_EVENT              ((uint16_t)(0x1UL << MXC_F_SDHC_INT_STAT_BLK_GAP_EVENT_POS)) /**< INT_STAT_BLK_GAP_EVENT Mask */

#define MXC_F_SDHC_INT_STAT_DMA_POS                    3 /**< INT_STAT_DMA Position */
#define MXC_F_SDHC_INT_STAT_DMA                        ((uint16_t)(0x1UL << MXC_F_SDHC_INT_STAT_DMA_POS)) /**< INT_STAT_DMA Mask */

#define MXC_F_SDHC_INT_STAT_BUFF_WR_READY_POS          4 /**< INT_STAT_BUFF_WR_READY Position */
#define MXC_F_SDHC_INT_STAT_BUFF_WR_READY              ((uint16_t)(0x1UL << MXC_F_SDHC_INT_STAT_BUFF_WR_READY_POS)) /**< INT_STAT_BUFF_WR_READY Mask */

#define MXC_F_SDHC_INT_STAT_BUFF_RD_READY_POS          5 /**< INT_STAT_BUFF_RD_READY Position */
#define MXC_F_SDHC_INT_STAT_BUFF_RD_READY              ((uint16_t)(0x1UL << MXC_F_SDHC_INT_STAT_BUFF_RD_READY_POS)) /**< INT_STAT_BUFF_RD_READY Mask */

#define MXC_F_SDHC_INT_STAT_CARD_INSERTION_POS         6 /**< INT_STAT_CARD_INSERTION Position */
#define MXC_F_SDHC_INT_STAT_CARD_INSERTION             ((uint16_t)(0x1UL << MXC_F_SDHC_INT_STAT_CARD_INSERTION_POS)) /**< INT_STAT_CARD_INSERTION Mask */

#define MXC_F_SDHC_INT_STAT_CARD_REMOVAL_POS           7 /**< INT_STAT_CARD_REMOVAL Position */
#define MXC_F_SDHC_INT_STAT_CARD_REMOVAL               ((uint16_t)(0x1UL << MXC_F_SDHC_INT_STAT_CARD_REMOVAL_POS)) /**< INT_STAT_CARD_REMOVAL Mask */

#define MXC_F_SDHC_INT_STAT_CARD_INTR_POS              8 /**< INT_STAT_CARD_INTR Position */
#define MXC_F_SDHC_INT_STAT_CARD_INTR                  ((uint16_t)(0x1UL << MXC_F_SDHC_INT_STAT_CARD_INTR_POS)) /**< INT_STAT_CARD_INTR Mask */

#define MXC_F_SDHC_INT_STAT_RETUNING_POS               12 /**< INT_STAT_RETUNING Position */
#define MXC_F_SDHC_INT_STAT_RETUNING                   ((uint16_t)(0x1UL << MXC_F_SDHC_INT_STAT_RETUNING_POS)) /**< INT_STAT_RETUNING Mask */

#define MXC_F_SDHC_INT_STAT_ERR_INTR_POS               15 /**< INT_STAT_ERR_INTR Position */
#define MXC_F_SDHC_INT_STAT_ERR_INTR                   ((uint16_t)(0x1UL << MXC_F_SDHC_INT_STAT_ERR_INTR_POS)) /**< INT_STAT_ERR_INTR Mask */

/**@} end of group SDHC_INT_STAT_Register */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_ER_INT_STAT SDHC_ER_INT_STAT
 * @brief    Error Interrupt Status.
 * @{
 */
#define MXC_F_SDHC_ER_INT_STAT_CMD_TO_POS              0 /**< ER_INT_STAT_CMD_TO Position */
#define MXC_F_SDHC_ER_INT_STAT_CMD_TO                  ((uint16_t)(0x1UL << MXC_F_SDHC_ER_INT_STAT_CMD_TO_POS)) /**< ER_INT_STAT_CMD_TO Mask */

#define MXC_F_SDHC_ER_INT_STAT_CMD_CRC_POS             1 /**< ER_INT_STAT_CMD_CRC Position */
#define MXC_F_SDHC_ER_INT_STAT_CMD_CRC                 ((uint16_t)(0x1UL << MXC_F_SDHC_ER_INT_STAT_CMD_CRC_POS)) /**< ER_INT_STAT_CMD_CRC Mask */

#define MXC_F_SDHC_ER_INT_STAT_CMD_END_BIT_POS         2 /**< ER_INT_STAT_CMD_END_BIT Position */
#define MXC_F_SDHC_ER_INT_STAT_CMD_END_BIT             ((uint16_t)(0x1UL << MXC_F_SDHC_ER_INT_STAT_CMD_END_BIT_POS)) /**< ER_INT_STAT_CMD_END_BIT Mask */

#define MXC_F_SDHC_ER_INT_STAT_CMD_IDX_POS             3 /**< ER_INT_STAT_CMD_IDX Position */
#define MXC_F_SDHC_ER_INT_STAT_CMD_IDX                 ((uint16_t)(0x1UL << MXC_F_SDHC_ER_INT_STAT_CMD_IDX_POS)) /**< ER_INT_STAT_CMD_IDX Mask */

#define MXC_F_SDHC_ER_INT_STAT_DATA_TO_POS             4 /**< ER_INT_STAT_DATA_TO Position */
#define MXC_F_SDHC_ER_INT_STAT_DATA_TO                 ((uint16_t)(0x1UL << MXC_F_SDHC_ER_INT_STAT_DATA_TO_POS)) /**< ER_INT_STAT_DATA_TO Mask */

#define MXC_F_SDHC_ER_INT_STAT_DATA_CRC_POS            5 /**< ER_INT_STAT_DATA_CRC Position */
#define MXC_F_SDHC_ER_INT_STAT_DATA_CRC                ((uint16_t)(0x1UL << MXC_F_SDHC_ER_INT_STAT_DATA_CRC_POS)) /**< ER_INT_STAT_DATA_CRC Mask */

#define MXC_F_SDHC_ER_INT_STAT_DATA_END_BIT_POS        6 /**< ER_INT_STAT_DATA_END_BIT Position */
#define MXC_F_SDHC_ER_INT_STAT_DATA_END_BIT            ((uint16_t)(0x1UL << MXC_F_SDHC_ER_INT_STAT_DATA_END_BIT_POS)) /**< ER_INT_STAT_DATA_END_BIT Mask */

#define MXC_F_SDHC_ER_INT_STAT_CURRENT_LIMIT_POS       7 /**< ER_INT_STAT_CURRENT_LIMIT Position */
#define MXC_F_SDHC_ER_INT_STAT_CURRENT_LIMIT           ((uint16_t)(0x1UL << MXC_F_SDHC_ER_INT_STAT_CURRENT_LIMIT_POS)) /**< ER_INT_STAT_CURRENT_LIMIT Mask */

#define MXC_F_SDHC_ER_INT_STAT_AUTO_CMD_12_POS         8 /**< ER_INT_STAT_AUTO_CMD_12 Position */
#define MXC_F_SDHC_ER_INT_STAT_AUTO_CMD_12             ((uint16_t)(0x1UL << MXC_F_SDHC_ER_INT_STAT_AUTO_CMD_12_POS)) /**< ER_INT_STAT_AUTO_CMD_12 Mask */

#define MXC_F_SDHC_ER_INT_STAT_ADMA_POS                9 /**< ER_INT_STAT_ADMA Position */
#define MXC_F_SDHC_ER_INT_STAT_ADMA                    ((uint16_t)(0x1UL << MXC_F_SDHC_ER_INT_STAT_ADMA_POS)) /**< ER_INT_STAT_ADMA Mask */

#define MXC_F_SDHC_ER_INT_STAT_DMA_POS                 12 /**< ER_INT_STAT_DMA Position */
#define MXC_F_SDHC_ER_INT_STAT_DMA                     ((uint16_t)(0x1UL << MXC_F_SDHC_ER_INT_STAT_DMA_POS)) /**< ER_INT_STAT_DMA Mask */

/**@} end of group SDHC_ER_INT_STAT_Register */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_INT_EN SDHC_INT_EN
 * @brief    Normal Interrupt Status Enable.
 * @{
 */
#define MXC_F_SDHC_INT_EN_CMD_COMP_POS                 0 /**< INT_EN_CMD_COMP Position */
#define MXC_F_SDHC_INT_EN_CMD_COMP                     ((uint16_t)(0x1UL << MXC_F_SDHC_INT_EN_CMD_COMP_POS)) /**< INT_EN_CMD_COMP Mask */

#define MXC_F_SDHC_INT_EN_TRANS_COMP_POS               1 /**< INT_EN_TRANS_COMP Position */
#define MXC_F_SDHC_INT_EN_TRANS_COMP                   ((uint16_t)(0x1UL << MXC_F_SDHC_INT_EN_TRANS_COMP_POS)) /**< INT_EN_TRANS_COMP Mask */

#define MXC_F_SDHC_INT_EN_BLK_GAP_POS                  2 /**< INT_EN_BLK_GAP Position */
#define MXC_F_SDHC_INT_EN_BLK_GAP                      ((uint16_t)(0x1UL << MXC_F_SDHC_INT_EN_BLK_GAP_POS)) /**< INT_EN_BLK_GAP Mask */

#define MXC_F_SDHC_INT_EN_DMA_POS                      3 /**< INT_EN_DMA Position */
#define MXC_F_SDHC_INT_EN_DMA                          ((uint16_t)(0x1UL << MXC_F_SDHC_INT_EN_DMA_POS)) /**< INT_EN_DMA Mask */

#define MXC_F_SDHC_INT_EN_BUFFER_WR_POS                4 /**< INT_EN_BUFFER_WR Position */
#define MXC_F_SDHC_INT_EN_BUFFER_WR                    ((uint16_t)(0x1UL << MXC_F_SDHC_INT_EN_BUFFER_WR_POS)) /**< INT_EN_BUFFER_WR Mask */

#define MXC_F_SDHC_INT_EN_BUFFER_RD_POS                5 /**< INT_EN_BUFFER_RD Position */
#define MXC_F_SDHC_INT_EN_BUFFER_RD                    ((uint16_t)(0x1UL << MXC_F_SDHC_INT_EN_BUFFER_RD_POS)) /**< INT_EN_BUFFER_RD Mask */

#define MXC_F_SDHC_INT_EN_CARD_INSERT_POS              6 /**< INT_EN_CARD_INSERT Position */
#define MXC_F_SDHC_INT_EN_CARD_INSERT                  ((uint16_t)(0x1UL << MXC_F_SDHC_INT_EN_CARD_INSERT_POS)) /**< INT_EN_CARD_INSERT Mask */

#define MXC_F_SDHC_INT_EN_CARD_REMOVAL_POS             7 /**< INT_EN_CARD_REMOVAL Position */
#define MXC_F_SDHC_INT_EN_CARD_REMOVAL                 ((uint16_t)(0x1UL << MXC_F_SDHC_INT_EN_CARD_REMOVAL_POS)) /**< INT_EN_CARD_REMOVAL Mask */

#define MXC_F_SDHC_INT_EN_CARD_INT_POS                 8 /**< INT_EN_CARD_INT Position */
#define MXC_F_SDHC_INT_EN_CARD_INT                     ((uint16_t)(0x1UL << MXC_F_SDHC_INT_EN_CARD_INT_POS)) /**< INT_EN_CARD_INT Mask */

#define MXC_F_SDHC_INT_EN_RETUNING_POS                 12 /**< INT_EN_RETUNING Position */
#define MXC_F_SDHC_INT_EN_RETUNING                     ((uint16_t)(0x1UL << MXC_F_SDHC_INT_EN_RETUNING_POS)) /**< INT_EN_RETUNING Mask */

/**@} end of group SDHC_INT_EN_Register */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_ER_INT_EN SDHC_ER_INT_EN
 * @brief    Error Interrupt Status Enable.
 * @{
 */
#define MXC_F_SDHC_ER_INT_EN_CMD_TO_POS                0 /**< ER_INT_EN_CMD_TO Position */
#define MXC_F_SDHC_ER_INT_EN_CMD_TO                    ((uint16_t)(0x1UL << MXC_F_SDHC_ER_INT_EN_CMD_TO_POS)) /**< ER_INT_EN_CMD_TO Mask */

#define MXC_F_SDHC_ER_INT_EN_CMD_CRC_POS               1 /**< ER_INT_EN_CMD_CRC Position */
#define MXC_F_SDHC_ER_INT_EN_CMD_CRC                   ((uint16_t)(0x1UL << MXC_F_SDHC_ER_INT_EN_CMD_CRC_POS)) /**< ER_INT_EN_CMD_CRC Mask */

#define MXC_F_SDHC_ER_INT_EN_CMD_END_BIT_POS           2 /**< ER_INT_EN_CMD_END_BIT Position */
#define MXC_F_SDHC_ER_INT_EN_CMD_END_BIT               ((uint16_t)(0x1UL << MXC_F_SDHC_ER_INT_EN_CMD_END_BIT_POS)) /**< ER_INT_EN_CMD_END_BIT Mask */

#define MXC_F_SDHC_ER_INT_EN_CMD_IDX_POS               3 /**< ER_INT_EN_CMD_IDX Position */
#define MXC_F_SDHC_ER_INT_EN_CMD_IDX                   ((uint16_t)(0x1UL << MXC_F_SDHC_ER_INT_EN_CMD_IDX_POS)) /**< ER_INT_EN_CMD_IDX Mask */

