analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/sdhc_regs.h
#define MXC_F_SDHC_ER_INT_EN_DATA_TO_POS               4 /**< ER_INT_EN_DATA_TO Position */
#define MXC_F_SDHC_ER_INT_EN_DATA_TO                   ((uint16_t)(0x1UL << MXC_F_SDHC_ER_INT_EN_DATA_TO_POS)) /**< ER_INT_EN_DATA_TO Mask */

#define MXC_F_SDHC_ER_INT_EN_DATA_CRC_POS              5 /**< ER_INT_EN_DATA_CRC Position */
#define MXC_F_SDHC_ER_INT_EN_DATA_CRC                  ((uint16_t)(0x1UL << MXC_F_SDHC_ER_INT_EN_DATA_CRC_POS)) /**< ER_INT_EN_DATA_CRC Mask */

#define MXC_F_SDHC_ER_INT_EN_DATA_END_BIT_POS          6 /**< ER_INT_EN_DATA_END_BIT Position */
#define MXC_F_SDHC_ER_INT_EN_DATA_END_BIT              ((uint16_t)(0x1UL << MXC_F_SDHC_ER_INT_EN_DATA_END_BIT_POS)) /**< ER_INT_EN_DATA_END_BIT Mask */

#define MXC_F_SDHC_ER_INT_EN_AUTO_CMD_12_POS           8 /**< ER_INT_EN_AUTO_CMD_12 Position */
#define MXC_F_SDHC_ER_INT_EN_AUTO_CMD_12               ((uint16_t)(0x1UL << MXC_F_SDHC_ER_INT_EN_AUTO_CMD_12_POS)) /**< ER_INT_EN_AUTO_CMD_12 Mask */

#define MXC_F_SDHC_ER_INT_EN_ADMA_POS                  9 /**< ER_INT_EN_ADMA Position */
#define MXC_F_SDHC_ER_INT_EN_ADMA                      ((uint16_t)(0x1UL << MXC_F_SDHC_ER_INT_EN_ADMA_POS)) /**< ER_INT_EN_ADMA Mask */

#define MXC_F_SDHC_ER_INT_EN_TUNING_POS                10 /**< ER_INT_EN_TUNING Position */
#define MXC_F_SDHC_ER_INT_EN_TUNING                    ((uint16_t)(0x1UL << MXC_F_SDHC_ER_INT_EN_TUNING_POS)) /**< ER_INT_EN_TUNING Mask */

#define MXC_F_SDHC_ER_INT_EN_VENDOR_POS                12 /**< ER_INT_EN_VENDOR Position */
#define MXC_F_SDHC_ER_INT_EN_VENDOR                    ((uint16_t)(0x1UL << MXC_F_SDHC_ER_INT_EN_VENDOR_POS)) /**< ER_INT_EN_VENDOR Mask */

/**@} end of group SDHC_ER_INT_EN_Register */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_INT_SIGNAL SDHC_INT_SIGNAL
 * @brief    Normal Interrupt Signal Enable.
 * @{
 */
#define MXC_F_SDHC_INT_SIGNAL_CMD_COMP_POS             0 /**< INT_SIGNAL_CMD_COMP Position */
#define MXC_F_SDHC_INT_SIGNAL_CMD_COMP                 ((uint16_t)(0x1UL << MXC_F_SDHC_INT_SIGNAL_CMD_COMP_POS)) /**< INT_SIGNAL_CMD_COMP Mask */

#define MXC_F_SDHC_INT_SIGNAL_TRANS_COMP_POS           1 /**< INT_SIGNAL_TRANS_COMP Position */
#define MXC_F_SDHC_INT_SIGNAL_TRANS_COMP               ((uint16_t)(0x1UL << MXC_F_SDHC_INT_SIGNAL_TRANS_COMP_POS)) /**< INT_SIGNAL_TRANS_COMP Mask */

#define MXC_F_SDHC_INT_SIGNAL_BLK_GAP_POS              2 /**< INT_SIGNAL_BLK_GAP Position */
#define MXC_F_SDHC_INT_SIGNAL_BLK_GAP                  ((uint16_t)(0x1UL << MXC_F_SDHC_INT_SIGNAL_BLK_GAP_POS)) /**< INT_SIGNAL_BLK_GAP Mask */

#define MXC_F_SDHC_INT_SIGNAL_DMA_POS                  3 /**< INT_SIGNAL_DMA Position */
#define MXC_F_SDHC_INT_SIGNAL_DMA                      ((uint16_t)(0x1UL << MXC_F_SDHC_INT_SIGNAL_DMA_POS)) /**< INT_SIGNAL_DMA Mask */

#define MXC_F_SDHC_INT_SIGNAL_BUFFER_WR_POS            4 /**< INT_SIGNAL_BUFFER_WR Position */
#define MXC_F_SDHC_INT_SIGNAL_BUFFER_WR                ((uint16_t)(0x1UL << MXC_F_SDHC_INT_SIGNAL_BUFFER_WR_POS)) /**< INT_SIGNAL_BUFFER_WR Mask */

#define MXC_F_SDHC_INT_SIGNAL_BUFFER_RD_POS            5 /**< INT_SIGNAL_BUFFER_RD Position */
#define MXC_F_SDHC_INT_SIGNAL_BUFFER_RD                ((uint16_t)(0x1UL << MXC_F_SDHC_INT_SIGNAL_BUFFER_RD_POS)) /**< INT_SIGNAL_BUFFER_RD Mask */

#define MXC_F_SDHC_INT_SIGNAL_CARD_INSERT_POS          6 /**< INT_SIGNAL_CARD_INSERT Position */
#define MXC_F_SDHC_INT_SIGNAL_CARD_INSERT              ((uint16_t)(0x1UL << MXC_F_SDHC_INT_SIGNAL_CARD_INSERT_POS)) /**< INT_SIGNAL_CARD_INSERT Mask */

#define MXC_F_SDHC_INT_SIGNAL_CARD_REMOVAL_POS         7 /**< INT_SIGNAL_CARD_REMOVAL Position */
#define MXC_F_SDHC_INT_SIGNAL_CARD_REMOVAL             ((uint16_t)(0x1UL << MXC_F_SDHC_INT_SIGNAL_CARD_REMOVAL_POS)) /**< INT_SIGNAL_CARD_REMOVAL Mask */

#define MXC_F_SDHC_INT_SIGNAL_CARD_INT_POS             8 /**< INT_SIGNAL_CARD_INT Position */
#define MXC_F_SDHC_INT_SIGNAL_CARD_INT                 ((uint16_t)(0x1UL << MXC_F_SDHC_INT_SIGNAL_CARD_INT_POS)) /**< INT_SIGNAL_CARD_INT Mask */

#define MXC_F_SDHC_INT_SIGNAL_RETUNING_POS             12 /**< INT_SIGNAL_RETUNING Position */
#define MXC_F_SDHC_INT_SIGNAL_RETUNING                 ((uint16_t)(0x1UL << MXC_F_SDHC_INT_SIGNAL_RETUNING_POS)) /**< INT_SIGNAL_RETUNING Mask */

/**@} end of group SDHC_INT_SIGNAL_Register */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_ER_INT_SIGNAL SDHC_ER_INT_SIGNAL
 * @brief    Error Interrupt Signal Enable.
 * @{
 */
#define MXC_F_SDHC_ER_INT_SIGNAL_CMD_TO_POS            0 /**< ER_INT_SIGNAL_CMD_TO Position */
#define MXC_F_SDHC_ER_INT_SIGNAL_CMD_TO                ((uint16_t)(0x1UL << MXC_F_SDHC_ER_INT_SIGNAL_CMD_TO_POS)) /**< ER_INT_SIGNAL_CMD_TO Mask */

#define MXC_F_SDHC_ER_INT_SIGNAL_CMD_CRC_POS           1 /**< ER_INT_SIGNAL_CMD_CRC Position */
#define MXC_F_SDHC_ER_INT_SIGNAL_CMD_CRC               ((uint16_t)(0x1UL << MXC_F_SDHC_ER_INT_SIGNAL_CMD_CRC_POS)) /**< ER_INT_SIGNAL_CMD_CRC Mask */

#define MXC_F_SDHC_ER_INT_SIGNAL_CMD_END_BIT_POS       2 /**< ER_INT_SIGNAL_CMD_END_BIT Position */
#define MXC_F_SDHC_ER_INT_SIGNAL_CMD_END_BIT           ((uint16_t)(0x1UL << MXC_F_SDHC_ER_INT_SIGNAL_CMD_END_BIT_POS)) /**< ER_INT_SIGNAL_CMD_END_BIT Mask */

#define MXC_F_SDHC_ER_INT_SIGNAL_CMD_IDX_POS           3 /**< ER_INT_SIGNAL_CMD_IDX Position */
#define MXC_F_SDHC_ER_INT_SIGNAL_CMD_IDX               ((uint16_t)(0x1UL << MXC_F_SDHC_ER_INT_SIGNAL_CMD_IDX_POS)) /**< ER_INT_SIGNAL_CMD_IDX Mask */

#define MXC_F_SDHC_ER_INT_SIGNAL_DATA_TO_POS           4 /**< ER_INT_SIGNAL_DATA_TO Position */
#define MXC_F_SDHC_ER_INT_SIGNAL_DATA_TO               ((uint16_t)(0x1UL << MXC_F_SDHC_ER_INT_SIGNAL_DATA_TO_POS)) /**< ER_INT_SIGNAL_DATA_TO Mask */

#define MXC_F_SDHC_ER_INT_SIGNAL_DATA_CRC_POS          5 /**< ER_INT_SIGNAL_DATA_CRC Position */
#define MXC_F_SDHC_ER_INT_SIGNAL_DATA_CRC              ((uint16_t)(0x1UL << MXC_F_SDHC_ER_INT_SIGNAL_DATA_CRC_POS)) /**< ER_INT_SIGNAL_DATA_CRC Mask */

#define MXC_F_SDHC_ER_INT_SIGNAL_DATA_END_BIT_POS      6 /**< ER_INT_SIGNAL_DATA_END_BIT Position */
#define MXC_F_SDHC_ER_INT_SIGNAL_DATA_END_BIT          ((uint16_t)(0x1UL << MXC_F_SDHC_ER_INT_SIGNAL_DATA_END_BIT_POS)) /**< ER_INT_SIGNAL_DATA_END_BIT Mask */

#define MXC_F_SDHC_ER_INT_SIGNAL_CURRENT_LIMIT_POS     7 /**< ER_INT_SIGNAL_CURRENT_LIMIT Position */
#define MXC_F_SDHC_ER_INT_SIGNAL_CURRENT_LIMIT         ((uint16_t)(0x1UL << MXC_F_SDHC_ER_INT_SIGNAL_CURRENT_LIMIT_POS)) /**< ER_INT_SIGNAL_CURRENT_LIMIT Mask */

#define MXC_F_SDHC_ER_INT_SIGNAL_AUTO_CMD_12_POS       8 /**< ER_INT_SIGNAL_AUTO_CMD_12 Position */
#define MXC_F_SDHC_ER_INT_SIGNAL_AUTO_CMD_12           ((uint16_t)(0x1UL << MXC_F_SDHC_ER_INT_SIGNAL_AUTO_CMD_12_POS)) /**< ER_INT_SIGNAL_AUTO_CMD_12 Mask */

#define MXC_F_SDHC_ER_INT_SIGNAL_ADMA_POS              9 /**< ER_INT_SIGNAL_ADMA Position */
#define MXC_F_SDHC_ER_INT_SIGNAL_ADMA                  ((uint16_t)(0x1UL << MXC_F_SDHC_ER_INT_SIGNAL_ADMA_POS)) /**< ER_INT_SIGNAL_ADMA Mask */

#define MXC_F_SDHC_ER_INT_SIGNAL_TUNING_POS            10 /**< ER_INT_SIGNAL_TUNING Position */
#define MXC_F_SDHC_ER_INT_SIGNAL_TUNING                ((uint16_t)(0x1UL << MXC_F_SDHC_ER_INT_SIGNAL_TUNING_POS)) /**< ER_INT_SIGNAL_TUNING Mask */

