analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/sdhc_regs.h
#define MXC_F_SDHC_ER_INT_SIGNAL_TAR_RESP_POS          12 /**< ER_INT_SIGNAL_TAR_RESP Position */
#define MXC_F_SDHC_ER_INT_SIGNAL_TAR_RESP              ((uint16_t)(0x1UL << MXC_F_SDHC_ER_INT_SIGNAL_TAR_RESP_POS)) /**< ER_INT_SIGNAL_TAR_RESP Mask */

/**@} end of group SDHC_ER_INT_SIGNAL_Register */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_AUTO_CMD_ER SDHC_AUTO_CMD_ER
 * @brief    Auto CMD Error Status.
 * @{
 */
#define MXC_F_SDHC_AUTO_CMD_ER_NOT_EXCUTED_POS         0 /**< AUTO_CMD_ER_NOT_EXCUTED Position */
#define MXC_F_SDHC_AUTO_CMD_ER_NOT_EXCUTED             ((uint16_t)(0x1UL << MXC_F_SDHC_AUTO_CMD_ER_NOT_EXCUTED_POS)) /**< AUTO_CMD_ER_NOT_EXCUTED Mask */

#define MXC_F_SDHC_AUTO_CMD_ER_TO_POS                  1 /**< AUTO_CMD_ER_TO Position */
#define MXC_F_SDHC_AUTO_CMD_ER_TO                      ((uint16_t)(0x1UL << MXC_F_SDHC_AUTO_CMD_ER_TO_POS)) /**< AUTO_CMD_ER_TO Mask */

#define MXC_F_SDHC_AUTO_CMD_ER_CRC_POS                 2 /**< AUTO_CMD_ER_CRC Position */
#define MXC_F_SDHC_AUTO_CMD_ER_CRC                     ((uint16_t)(0x1UL << MXC_F_SDHC_AUTO_CMD_ER_CRC_POS)) /**< AUTO_CMD_ER_CRC Mask */

#define MXC_F_SDHC_AUTO_CMD_ER_END_BIT_POS             3 /**< AUTO_CMD_ER_END_BIT Position */
#define MXC_F_SDHC_AUTO_CMD_ER_END_BIT                 ((uint16_t)(0x1UL << MXC_F_SDHC_AUTO_CMD_ER_END_BIT_POS)) /**< AUTO_CMD_ER_END_BIT Mask */

#define MXC_F_SDHC_AUTO_CMD_ER_INDEX_POS               4 /**< AUTO_CMD_ER_INDEX Position */
#define MXC_F_SDHC_AUTO_CMD_ER_INDEX                   ((uint16_t)(0x1UL << MXC_F_SDHC_AUTO_CMD_ER_INDEX_POS)) /**< AUTO_CMD_ER_INDEX Mask */

#define MXC_F_SDHC_AUTO_CMD_ER_NOT_ISSUED_POS          7 /**< AUTO_CMD_ER_NOT_ISSUED Position */
#define MXC_F_SDHC_AUTO_CMD_ER_NOT_ISSUED              ((uint16_t)(0x1UL << MXC_F_SDHC_AUTO_CMD_ER_NOT_ISSUED_POS)) /**< AUTO_CMD_ER_NOT_ISSUED Mask */

/**@} end of group SDHC_AUTO_CMD_ER_Register */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_HOST_CN_2 SDHC_HOST_CN_2
 * @brief    Host Control 2.
 * @{
 */
#define MXC_F_SDHC_HOST_CN_2_UHS_POS                   0 /**< HOST_CN_2_UHS Position */
#define MXC_F_SDHC_HOST_CN_2_UHS                       ((uint16_t)(0x7UL << MXC_F_SDHC_HOST_CN_2_UHS_POS)) /**< HOST_CN_2_UHS Mask */
#define MXC_V_SDHC_HOST_CN_2_UHS_SDR12                 ((uint16_t)0x0UL) /**< HOST_CN_2_UHS_SDR12 Value */
#define MXC_S_SDHC_HOST_CN_2_UHS_SDR12                 (MXC_V_SDHC_HOST_CN_2_UHS_SDR12 << MXC_F_SDHC_HOST_CN_2_UHS_POS) /**< HOST_CN_2_UHS_SDR12 Setting */
#define MXC_V_SDHC_HOST_CN_2_UHS_SDR25                 ((uint16_t)0x1UL) /**< HOST_CN_2_UHS_SDR25 Value */
#define MXC_S_SDHC_HOST_CN_2_UHS_SDR25                 (MXC_V_SDHC_HOST_CN_2_UHS_SDR25 << MXC_F_SDHC_HOST_CN_2_UHS_POS) /**< HOST_CN_2_UHS_SDR25 Setting */
#define MXC_V_SDHC_HOST_CN_2_UHS_SDR50                 ((uint16_t)0x2UL) /**< HOST_CN_2_UHS_SDR50 Value */
#define MXC_S_SDHC_HOST_CN_2_UHS_SDR50                 (MXC_V_SDHC_HOST_CN_2_UHS_SDR50 << MXC_F_SDHC_HOST_CN_2_UHS_POS) /**< HOST_CN_2_UHS_SDR50 Setting */
#define MXC_V_SDHC_HOST_CN_2_UHS_DDR50                 ((uint16_t)0x4UL) /**< HOST_CN_2_UHS_DDR50 Value */
#define MXC_S_SDHC_HOST_CN_2_UHS_DDR50                 (MXC_V_SDHC_HOST_CN_2_UHS_DDR50 << MXC_F_SDHC_HOST_CN_2_UHS_POS) /**< HOST_CN_2_UHS_DDR50 Setting */

#define MXC_F_SDHC_HOST_CN_2_1_8V_SIGNAL_POS           3 /**< HOST_CN_2_1_8V_SIGNAL Position */
#define MXC_F_SDHC_HOST_CN_2_1_8V_SIGNAL               ((uint16_t)(0x1UL << MXC_F_SDHC_HOST_CN_2_1_8V_SIGNAL_POS)) /**< HOST_CN_2_1_8V_SIGNAL Mask */

#define MXC_F_SDHC_HOST_CN_2_DRIVER_STRENGTH_POS       4 /**< HOST_CN_2_DRIVER_STRENGTH Position */
#define MXC_F_SDHC_HOST_CN_2_DRIVER_STRENGTH           ((uint16_t)(0x3UL << MXC_F_SDHC_HOST_CN_2_DRIVER_STRENGTH_POS)) /**< HOST_CN_2_DRIVER_STRENGTH Mask */
#define MXC_V_SDHC_HOST_CN_2_DRIVER_STRENGTH_TYPEB     ((uint16_t)0x0UL) /**< HOST_CN_2_DRIVER_STRENGTH_TYPEB Value */
#define MXC_S_SDHC_HOST_CN_2_DRIVER_STRENGTH_TYPEB     (MXC_V_SDHC_HOST_CN_2_DRIVER_STRENGTH_TYPEB << MXC_F_SDHC_HOST_CN_2_DRIVER_STRENGTH_POS) /**< HOST_CN_2_DRIVER_STRENGTH_TYPEB Setting */
#define MXC_V_SDHC_HOST_CN_2_DRIVER_STRENGTH_TYPEA     ((uint16_t)0x1UL) /**< HOST_CN_2_DRIVER_STRENGTH_TYPEA Value */
#define MXC_S_SDHC_HOST_CN_2_DRIVER_STRENGTH_TYPEA     (MXC_V_SDHC_HOST_CN_2_DRIVER_STRENGTH_TYPEA << MXC_F_SDHC_HOST_CN_2_DRIVER_STRENGTH_POS) /**< HOST_CN_2_DRIVER_STRENGTH_TYPEA Setting */
#define MXC_V_SDHC_HOST_CN_2_DRIVER_STRENGTH_TYPEC     ((uint16_t)0x2UL) /**< HOST_CN_2_DRIVER_STRENGTH_TYPEC Value */
#define MXC_S_SDHC_HOST_CN_2_DRIVER_STRENGTH_TYPEC     (MXC_V_SDHC_HOST_CN_2_DRIVER_STRENGTH_TYPEC << MXC_F_SDHC_HOST_CN_2_DRIVER_STRENGTH_POS) /**< HOST_CN_2_DRIVER_STRENGTH_TYPEC Setting */
#define MXC_V_SDHC_HOST_CN_2_DRIVER_STRENGTH_TYPRD     ((uint16_t)0x3UL) /**< HOST_CN_2_DRIVER_STRENGTH_TYPRD Value */
#define MXC_S_SDHC_HOST_CN_2_DRIVER_STRENGTH_TYPRD     (MXC_V_SDHC_HOST_CN_2_DRIVER_STRENGTH_TYPRD << MXC_F_SDHC_HOST_CN_2_DRIVER_STRENGTH_POS) /**< HOST_CN_2_DRIVER_STRENGTH_TYPRD Setting */

#define MXC_F_SDHC_HOST_CN_2_EXCUTE_POS                6 /**< HOST_CN_2_EXCUTE Position */
#define MXC_F_SDHC_HOST_CN_2_EXCUTE                    ((uint16_t)(0x1UL << MXC_F_SDHC_HOST_CN_2_EXCUTE_POS)) /**< HOST_CN_2_EXCUTE Mask */

#define MXC_F_SDHC_HOST_CN_2_SAMPLING_CLK_POS          7 /**< HOST_CN_2_SAMPLING_CLK Position */
#define MXC_F_SDHC_HOST_CN_2_SAMPLING_CLK              ((uint16_t)(0x1UL << MXC_F_SDHC_HOST_CN_2_SAMPLING_CLK_POS)) /**< HOST_CN_2_SAMPLING_CLK Mask */

#define MXC_F_SDHC_HOST_CN_2_ASYNCH_INT_POS            14 /**< HOST_CN_2_ASYNCH_INT Position */
#define MXC_F_SDHC_HOST_CN_2_ASYNCH_INT                ((uint16_t)(0x1UL << MXC_F_SDHC_HOST_CN_2_ASYNCH_INT_POS)) /**< HOST_CN_2_ASYNCH_INT Mask */

#define MXC_F_SDHC_HOST_CN_2_PRESET_VAL_EN_POS         15 /**< HOST_CN_2_PRESET_VAL_EN Position */
#define MXC_F_SDHC_HOST_CN_2_PRESET_VAL_EN             ((uint16_t)(0x1UL << MXC_F_SDHC_HOST_CN_2_PRESET_VAL_EN_POS)) /**< HOST_CN_2_PRESET_VAL_EN Mask */

/**@} end of group SDHC_HOST_CN_2_Register */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_CFG_0 SDHC_CFG_0
 * @brief    Capabilities 0-31.
 * @{
 */
#define MXC_F_SDHC_CFG_0_TO_FREQ_POS                   0 /**< CFG_0_TO_FREQ Position */
#define MXC_F_SDHC_CFG_0_TO_FREQ                       ((uint32_t)(0x3FUL << MXC_F_SDHC_CFG_0_TO_FREQ_POS)) /**< CFG_0_TO_FREQ Mask */
#define MXC_V_SDHC_CFG_0_TO_FREQ_1MHZ                  ((uint32_t)0x1UL) /**< CFG_0_TO_FREQ_1MHZ Value */
#define MXC_S_SDHC_CFG_0_TO_FREQ_1MHZ                  (MXC_V_SDHC_CFG_0_TO_FREQ_1MHZ << MXC_F_SDHC_CFG_0_TO_FREQ_POS) /**< CFG_0_TO_FREQ_1MHZ Setting */

#define MXC_F_SDHC_CFG_0_CLK_UNIT_POS                  7 /**< CFG_0_CLK_UNIT Position */
#define MXC_F_SDHC_CFG_0_CLK_UNIT                      ((uint32_t)(0x1UL << MXC_F_SDHC_CFG_0_CLK_UNIT_POS)) /**< CFG_0_CLK_UNIT Mask */

#define MXC_F_SDHC_CFG_0_CLK_FREQ_POS                  8 /**< CFG_0_CLK_FREQ Position */
#define MXC_F_SDHC_CFG_0_CLK_FREQ                      ((uint32_t)(0xFFUL << MXC_F_SDHC_CFG_0_CLK_FREQ_POS)) /**< CFG_0_CLK_FREQ Mask */

#define MXC_F_SDHC_CFG_0_MAX_BLK_LEN_POS               16 /**< CFG_0_MAX_BLK_LEN Position */
#define MXC_F_SDHC_CFG_0_MAX_BLK_LEN                   ((uint32_t)(0x3UL << MXC_F_SDHC_CFG_0_MAX_BLK_LEN_POS)) /**< CFG_0_MAX_BLK_LEN Mask */
#define MXC_V_SDHC_CFG_0_MAX_BLK_LEN_2048_BYTES        ((uint32_t)0x2UL) /**< CFG_0_MAX_BLK_LEN_2048_BYTES Value */
#define MXC_S_SDHC_CFG_0_MAX_BLK_LEN_2048_BYTES        (MXC_V_SDHC_CFG_0_MAX_BLK_LEN_2048_BYTES << MXC_F_SDHC_CFG_0_MAX_BLK_LEN_POS) /**< CFG_0_MAX_BLK_LEN_2048_BYTES Setting */

#define MXC_F_SDHC_CFG_0_8_BIT_POS                     18 /**< CFG_0_8_BIT Position */
#define MXC_F_SDHC_CFG_0_8_BIT                         ((uint32_t)(0x1UL << MXC_F_SDHC_CFG_0_8_BIT_POS)) /**< CFG_0_8_BIT Mask */

#define MXC_F_SDHC_CFG_0_ADMA2_POS                     19 /**< CFG_0_ADMA2 Position */
#define MXC_F_SDHC_CFG_0_ADMA2                         ((uint32_t)(0x1UL << MXC_F_SDHC_CFG_0_ADMA2_POS)) /**< CFG_0_ADMA2 Mask */

#define MXC_F_SDHC_CFG_0_HS_POS                        21 /**< CFG_0_HS Position */
#define MXC_F_SDHC_CFG_0_HS                            ((uint32_t)(0x1UL << MXC_F_SDHC_CFG_0_HS_POS)) /**< CFG_0_HS Mask */

#define MXC_F_SDHC_CFG_0_SDMA_POS                      22 /**< CFG_0_SDMA Position */
#define MXC_F_SDHC_CFG_0_SDMA                          ((uint32_t)(0x1UL << MXC_F_SDHC_CFG_0_SDMA_POS)) /**< CFG_0_SDMA Mask */

#define MXC_F_SDHC_CFG_0_SUSPEND_POS                   23 /**< CFG_0_SUSPEND Position */
#define MXC_F_SDHC_CFG_0_SUSPEND                       ((uint32_t)(0x1UL << MXC_F_SDHC_CFG_0_SUSPEND_POS)) /**< CFG_0_SUSPEND Mask */

#define MXC_F_SDHC_CFG_0_3_3V_POS                      24 /**< CFG_0_3_3V Position */
#define MXC_F_SDHC_CFG_0_3_3V                          ((uint32_t)(0x1UL << MXC_F_SDHC_CFG_0_3_3V_POS)) /**< CFG_0_3_3V Mask */

#define MXC_F_SDHC_CFG_0_3_0V_POS                      25 /**< CFG_0_3_0V Position */
#define MXC_F_SDHC_CFG_0_3_0V                          ((uint32_t)(0x1UL << MXC_F_SDHC_CFG_0_3_0V_POS)) /**< CFG_0_3_0V Mask */

