analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/sdhc_regs.h
#define MXC_F_SDHC_CFG_0_1_8V_POS                      26 /**< CFG_0_1_8V Position */
#define MXC_F_SDHC_CFG_0_1_8V                          ((uint32_t)(0x1UL << MXC_F_SDHC_CFG_0_1_8V_POS)) /**< CFG_0_1_8V Mask */

#define MXC_F_SDHC_CFG_0_64_BIT_SYS_BUS_POS            28 /**< CFG_0_64_BIT_SYS_BUS Position */
#define MXC_F_SDHC_CFG_0_64_BIT_SYS_BUS                ((uint32_t)(0x1UL << MXC_F_SDHC_CFG_0_64_BIT_SYS_BUS_POS)) /**< CFG_0_64_BIT_SYS_BUS Mask */

#define MXC_F_SDHC_CFG_0_ASYNC_INT_POS                 29 /**< CFG_0_ASYNC_INT Position */
#define MXC_F_SDHC_CFG_0_ASYNC_INT                     ((uint32_t)(0x1UL << MXC_F_SDHC_CFG_0_ASYNC_INT_POS)) /**< CFG_0_ASYNC_INT Mask */

#define MXC_F_SDHC_CFG_0_SLOT_TYPE_POS                 30 /**< CFG_0_SLOT_TYPE Position */
#define MXC_F_SDHC_CFG_0_SLOT_TYPE                     ((uint32_t)(0x3UL << MXC_F_SDHC_CFG_0_SLOT_TYPE_POS)) /**< CFG_0_SLOT_TYPE Mask */

/**@} end of group SDHC_CFG_0_Register */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_CFG_1 SDHC_CFG_1
 * @brief    Capabilities 32-63.
 * @{
 */
#define MXC_F_SDHC_CFG_1_SDR50_POS                     0 /**< CFG_1_SDR50 Position */
#define MXC_F_SDHC_CFG_1_SDR50                         ((uint32_t)(0x1UL << MXC_F_SDHC_CFG_1_SDR50_POS)) /**< CFG_1_SDR50 Mask */

#define MXC_F_SDHC_CFG_1_SDR104_POS                    1 /**< CFG_1_SDR104 Position */
#define MXC_F_SDHC_CFG_1_SDR104                        ((uint32_t)(0x0UL << MXC_F_SDHC_CFG_1_SDR104_POS)) /**< CFG_1_SDR104 Mask */

#define MXC_F_SDHC_CFG_1_DDR50_POS                     2 /**< CFG_1_DDR50 Position */
#define MXC_F_SDHC_CFG_1_DDR50                         ((uint32_t)(0x1UL << MXC_F_SDHC_CFG_1_DDR50_POS)) /**< CFG_1_DDR50 Mask */

#define MXC_F_SDHC_CFG_1_DRIVER_A_POS                  4 /**< CFG_1_DRIVER_A Position */
#define MXC_F_SDHC_CFG_1_DRIVER_A                      ((uint32_t)(0x1UL << MXC_F_SDHC_CFG_1_DRIVER_A_POS)) /**< CFG_1_DRIVER_A Mask */

#define MXC_F_SDHC_CFG_1_DRIVER_C_POS                  5 /**< CFG_1_DRIVER_C Position */
#define MXC_F_SDHC_CFG_1_DRIVER_C                      ((uint32_t)(0x1UL << MXC_F_SDHC_CFG_1_DRIVER_C_POS)) /**< CFG_1_DRIVER_C Mask */

#define MXC_F_SDHC_CFG_1_DRIVER_D_POS                  6 /**< CFG_1_DRIVER_D Position */
#define MXC_F_SDHC_CFG_1_DRIVER_D                      ((uint32_t)(0x1UL << MXC_F_SDHC_CFG_1_DRIVER_D_POS)) /**< CFG_1_DRIVER_D Mask */

#define MXC_F_SDHC_CFG_1_TIMER_CNT_TUNING_POS          8 /**< CFG_1_TIMER_CNT_TUNING Position */
#define MXC_F_SDHC_CFG_1_TIMER_CNT_TUNING              ((uint32_t)(0xFUL << MXC_F_SDHC_CFG_1_TIMER_CNT_TUNING_POS)) /**< CFG_1_TIMER_CNT_TUNING Mask */
#define MXC_V_SDHC_CFG_1_TIMER_CNT_TUNING_DIS          ((uint32_t)0x0UL) /**< CFG_1_TIMER_CNT_TUNING_DIS Value */
#define MXC_S_SDHC_CFG_1_TIMER_CNT_TUNING_DIS          (MXC_V_SDHC_CFG_1_TIMER_CNT_TUNING_DIS << MXC_F_SDHC_CFG_1_TIMER_CNT_TUNING_POS) /**< CFG_1_TIMER_CNT_TUNING_DIS Setting */
#define MXC_V_SDHC_CFG_1_TIMER_CNT_TUNING_1SEC         ((uint32_t)0x1UL) /**< CFG_1_TIMER_CNT_TUNING_1SEC Value */
#define MXC_S_SDHC_CFG_1_TIMER_CNT_TUNING_1SEC         (MXC_V_SDHC_CFG_1_TIMER_CNT_TUNING_1SEC << MXC_F_SDHC_CFG_1_TIMER_CNT_TUNING_POS) /**< CFG_1_TIMER_CNT_TUNING_1SEC Setting */
#define MXC_V_SDHC_CFG_1_TIMER_CNT_TUNING_2SEC         ((uint32_t)0x2UL) /**< CFG_1_TIMER_CNT_TUNING_2SEC Value */
#define MXC_S_SDHC_CFG_1_TIMER_CNT_TUNING_2SEC         (MXC_V_SDHC_CFG_1_TIMER_CNT_TUNING_2SEC << MXC_F_SDHC_CFG_1_TIMER_CNT_TUNING_POS) /**< CFG_1_TIMER_CNT_TUNING_2SEC Setting */
#define MXC_V_SDHC_CFG_1_TIMER_CNT_TUNING_4SEC         ((uint32_t)0x3UL) /**< CFG_1_TIMER_CNT_TUNING_4SEC Value */
#define MXC_S_SDHC_CFG_1_TIMER_CNT_TUNING_4SEC         (MXC_V_SDHC_CFG_1_TIMER_CNT_TUNING_4SEC << MXC_F_SDHC_CFG_1_TIMER_CNT_TUNING_POS) /**< CFG_1_TIMER_CNT_TUNING_4SEC Setting */
#define MXC_V_SDHC_CFG_1_TIMER_CNT_TUNING_8SEC         ((uint32_t)0x4UL) /**< CFG_1_TIMER_CNT_TUNING_8SEC Value */
#define MXC_S_SDHC_CFG_1_TIMER_CNT_TUNING_8SEC         (MXC_V_SDHC_CFG_1_TIMER_CNT_TUNING_8SEC << MXC_F_SDHC_CFG_1_TIMER_CNT_TUNING_POS) /**< CFG_1_TIMER_CNT_TUNING_8SEC Setting */
#define MXC_V_SDHC_CFG_1_TIMER_CNT_TUNING_16SEC        ((uint32_t)0x5UL) /**< CFG_1_TIMER_CNT_TUNING_16SEC Value */
#define MXC_S_SDHC_CFG_1_TIMER_CNT_TUNING_16SEC        (MXC_V_SDHC_CFG_1_TIMER_CNT_TUNING_16SEC << MXC_F_SDHC_CFG_1_TIMER_CNT_TUNING_POS) /**< CFG_1_TIMER_CNT_TUNING_16SEC Setting */
#define MXC_V_SDHC_CFG_1_TIMER_CNT_TUNING_32SEC        ((uint32_t)0x6UL) /**< CFG_1_TIMER_CNT_TUNING_32SEC Value */
#define MXC_S_SDHC_CFG_1_TIMER_CNT_TUNING_32SEC        (MXC_V_SDHC_CFG_1_TIMER_CNT_TUNING_32SEC << MXC_F_SDHC_CFG_1_TIMER_CNT_TUNING_POS) /**< CFG_1_TIMER_CNT_TUNING_32SEC Setting */
#define MXC_V_SDHC_CFG_1_TIMER_CNT_TUNING_64SEC        ((uint32_t)0x7UL) /**< CFG_1_TIMER_CNT_TUNING_64SEC Value */
#define MXC_S_SDHC_CFG_1_TIMER_CNT_TUNING_64SEC        (MXC_V_SDHC_CFG_1_TIMER_CNT_TUNING_64SEC << MXC_F_SDHC_CFG_1_TIMER_CNT_TUNING_POS) /**< CFG_1_TIMER_CNT_TUNING_64SEC Setting */
#define MXC_V_SDHC_CFG_1_TIMER_CNT_TUNING_128SEC       ((uint32_t)0x8UL) /**< CFG_1_TIMER_CNT_TUNING_128SEC Value */
#define MXC_S_SDHC_CFG_1_TIMER_CNT_TUNING_128SEC       (MXC_V_SDHC_CFG_1_TIMER_CNT_TUNING_128SEC << MXC_F_SDHC_CFG_1_TIMER_CNT_TUNING_POS) /**< CFG_1_TIMER_CNT_TUNING_128SEC Setting */
#define MXC_V_SDHC_CFG_1_TIMER_CNT_TUNING_256SEC       ((uint32_t)0x9UL) /**< CFG_1_TIMER_CNT_TUNING_256SEC Value */
#define MXC_S_SDHC_CFG_1_TIMER_CNT_TUNING_256SEC       (MXC_V_SDHC_CFG_1_TIMER_CNT_TUNING_256SEC << MXC_F_SDHC_CFG_1_TIMER_CNT_TUNING_POS) /**< CFG_1_TIMER_CNT_TUNING_256SEC Setting */
#define MXC_V_SDHC_CFG_1_TIMER_CNT_TUNING_512SEC       ((uint32_t)0xAUL) /**< CFG_1_TIMER_CNT_TUNING_512SEC Value */
#define MXC_S_SDHC_CFG_1_TIMER_CNT_TUNING_512SEC       (MXC_V_SDHC_CFG_1_TIMER_CNT_TUNING_512SEC << MXC_F_SDHC_CFG_1_TIMER_CNT_TUNING_POS) /**< CFG_1_TIMER_CNT_TUNING_512SEC Setting */
#define MXC_V_SDHC_CFG_1_TIMER_CNT_TUNING_1024SEC      ((uint32_t)0xBUL) /**< CFG_1_TIMER_CNT_TUNING_1024SEC Value */
#define MXC_S_SDHC_CFG_1_TIMER_CNT_TUNING_1024SEC      (MXC_V_SDHC_CFG_1_TIMER_CNT_TUNING_1024SEC << MXC_F_SDHC_CFG_1_TIMER_CNT_TUNING_POS) /**< CFG_1_TIMER_CNT_TUNING_1024SEC Setting */

#define MXC_F_SDHC_CFG_1_TUNING_SDR50_POS              13 /**< CFG_1_TUNING_SDR50 Position */
#define MXC_F_SDHC_CFG_1_TUNING_SDR50                  ((uint32_t)(0x1UL << MXC_F_SDHC_CFG_1_TUNING_SDR50_POS)) /**< CFG_1_TUNING_SDR50 Mask */

#define MXC_F_SDHC_CFG_1_RETUNING_POS                  14 /**< CFG_1_RETUNING Position */
#define MXC_F_SDHC_CFG_1_RETUNING                      ((uint32_t)(0x3UL << MXC_F_SDHC_CFG_1_RETUNING_POS)) /**< CFG_1_RETUNING Mask */

#define MXC_F_SDHC_CFG_1_CLK_MULTI_POS                 16 /**< CFG_1_CLK_MULTI Position */
#define MXC_F_SDHC_CFG_1_CLK_MULTI                     ((uint32_t)(0xFFUL << MXC_F_SDHC_CFG_1_CLK_MULTI_POS)) /**< CFG_1_CLK_MULTI Mask */

