analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/sdhc_regs.h
/**@} end of group SDHC_CFG_1_Register */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_MAX_CURR_CFG SDHC_MAX_CURR_CFG
 * @brief    Maximum Current Capabilities.
 * @{
 */
#define MXC_F_SDHC_MAX_CURR_CFG_3_3V_POS               0 /**< MAX_CURR_CFG_3_3V Position */
#define MXC_F_SDHC_MAX_CURR_CFG_3_3V                   ((uint32_t)(0xFFUL << MXC_F_SDHC_MAX_CURR_CFG_3_3V_POS)) /**< MAX_CURR_CFG_3_3V Mask */

#define MXC_F_SDHC_MAX_CURR_CFG_3_0V_POS               8 /**< MAX_CURR_CFG_3_0V Position */
#define MXC_F_SDHC_MAX_CURR_CFG_3_0V                   ((uint32_t)(0xFFUL << MXC_F_SDHC_MAX_CURR_CFG_3_0V_POS)) /**< MAX_CURR_CFG_3_0V Mask */

#define MXC_F_SDHC_MAX_CURR_CFG_1_8V_POS               16 /**< MAX_CURR_CFG_1_8V Position */
#define MXC_F_SDHC_MAX_CURR_CFG_1_8V                   ((uint32_t)(0xFFUL << MXC_F_SDHC_MAX_CURR_CFG_1_8V_POS)) /**< MAX_CURR_CFG_1_8V Mask */

/**@} end of group SDHC_MAX_CURR_CFG_Register */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_FORCE_CMD SDHC_FORCE_CMD
 * @brief    Force Event for Auto CMD Error Status.
 * @{
 */
#define MXC_F_SDHC_FORCE_CMD_NOT_EXCU_POS              0 /**< FORCE_CMD_NOT_EXCU Position */
#define MXC_F_SDHC_FORCE_CMD_NOT_EXCU                  ((uint16_t)(0x1UL << MXC_F_SDHC_FORCE_CMD_NOT_EXCU_POS)) /**< FORCE_CMD_NOT_EXCU Mask */

#define MXC_F_SDHC_FORCE_CMD_TO_POS                    1 /**< FORCE_CMD_TO Position */
#define MXC_F_SDHC_FORCE_CMD_TO                        ((uint16_t)(0x1UL << MXC_F_SDHC_FORCE_CMD_TO_POS)) /**< FORCE_CMD_TO Mask */

#define MXC_F_SDHC_FORCE_CMD_CRC_POS                   2 /**< FORCE_CMD_CRC Position */
#define MXC_F_SDHC_FORCE_CMD_CRC                       ((uint16_t)(0x1UL << MXC_F_SDHC_FORCE_CMD_CRC_POS)) /**< FORCE_CMD_CRC Mask */

#define MXC_F_SDHC_FORCE_CMD_END_BIT_POS               3 /**< FORCE_CMD_END_BIT Position */
#define MXC_F_SDHC_FORCE_CMD_END_BIT                   ((uint16_t)(0x1UL << MXC_F_SDHC_FORCE_CMD_END_BIT_POS)) /**< FORCE_CMD_END_BIT Mask */

#define MXC_F_SDHC_FORCE_CMD_INDEX_POS                 4 /**< FORCE_CMD_INDEX Position */
#define MXC_F_SDHC_FORCE_CMD_INDEX                     ((uint16_t)(0x1UL << MXC_F_SDHC_FORCE_CMD_INDEX_POS)) /**< FORCE_CMD_INDEX Mask */

#define MXC_F_SDHC_FORCE_CMD_NOT_ISSUED_POS            7 /**< FORCE_CMD_NOT_ISSUED Position */
#define MXC_F_SDHC_FORCE_CMD_NOT_ISSUED                ((uint16_t)(0x1UL << MXC_F_SDHC_FORCE_CMD_NOT_ISSUED_POS)) /**< FORCE_CMD_NOT_ISSUED Mask */

/**@} end of group SDHC_FORCE_CMD_Register */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_FORCE_EVENT_INT_STAT SDHC_FORCE_EVENT_INT_STAT
 * @brief    Force Event for Error Interrupt Status.
 * @{
 */
#define MXC_F_SDHC_FORCE_EVENT_INT_STAT_CMD_TO_POS     0 /**< FORCE_EVENT_INT_STAT_CMD_TO Position */
#define MXC_F_SDHC_FORCE_EVENT_INT_STAT_CMD_TO         ((uint16_t)(0x1UL << MXC_F_SDHC_FORCE_EVENT_INT_STAT_CMD_TO_POS)) /**< FORCE_EVENT_INT_STAT_CMD_TO Mask */

#define MXC_F_SDHC_FORCE_EVENT_INT_STAT_CMD_CRC_POS    1 /**< FORCE_EVENT_INT_STAT_CMD_CRC Position */
#define MXC_F_SDHC_FORCE_EVENT_INT_STAT_CMD_CRC        ((uint16_t)(0x1UL << MXC_F_SDHC_FORCE_EVENT_INT_STAT_CMD_CRC_POS)) /**< FORCE_EVENT_INT_STAT_CMD_CRC Mask */

#define MXC_F_SDHC_FORCE_EVENT_INT_STAT_CMD_END_BIT_POS 2 /**< FORCE_EVENT_INT_STAT_CMD_END_BIT Position */
#define MXC_F_SDHC_FORCE_EVENT_INT_STAT_CMD_END_BIT    ((uint16_t)(0x1UL << MXC_F_SDHC_FORCE_EVENT_INT_STAT_CMD_END_BIT_POS)) /**< FORCE_EVENT_INT_STAT_CMD_END_BIT Mask */

#define MXC_F_SDHC_FORCE_EVENT_INT_STAT_CMD_INDEX_POS  3 /**< FORCE_EVENT_INT_STAT_CMD_INDEX Position */
#define MXC_F_SDHC_FORCE_EVENT_INT_STAT_CMD_INDEX      ((uint16_t)(0x1UL << MXC_F_SDHC_FORCE_EVENT_INT_STAT_CMD_INDEX_POS)) /**< FORCE_EVENT_INT_STAT_CMD_INDEX Mask */

#define MXC_F_SDHC_FORCE_EVENT_INT_STAT_DATA_TO_POS    4 /**< FORCE_EVENT_INT_STAT_DATA_TO Position */
#define MXC_F_SDHC_FORCE_EVENT_INT_STAT_DATA_TO        ((uint16_t)(0x1UL << MXC_F_SDHC_FORCE_EVENT_INT_STAT_DATA_TO_POS)) /**< FORCE_EVENT_INT_STAT_DATA_TO Mask */

#define MXC_F_SDHC_FORCE_EVENT_INT_STAT_DATA_CRC_POS   5 /**< FORCE_EVENT_INT_STAT_DATA_CRC Position */
#define MXC_F_SDHC_FORCE_EVENT_INT_STAT_DATA_CRC       ((uint16_t)(0x1UL << MXC_F_SDHC_FORCE_EVENT_INT_STAT_DATA_CRC_POS)) /**< FORCE_EVENT_INT_STAT_DATA_CRC Mask */

#define MXC_F_SDHC_FORCE_EVENT_INT_STAT_DATA_END_BIT_POS 6 /**< FORCE_EVENT_INT_STAT_DATA_END_BIT Position */
#define MXC_F_SDHC_FORCE_EVENT_INT_STAT_DATA_END_BIT   ((uint16_t)(0x1UL << MXC_F_SDHC_FORCE_EVENT_INT_STAT_DATA_END_BIT_POS)) /**< FORCE_EVENT_INT_STAT_DATA_END_BIT Mask */

#define MXC_F_SDHC_FORCE_EVENT_INT_STAT_CURR_LIMIT_POS 7 /**< FORCE_EVENT_INT_STAT_CURR_LIMIT Position */
#define MXC_F_SDHC_FORCE_EVENT_INT_STAT_CURR_LIMIT     ((uint16_t)(0x1UL << MXC_F_SDHC_FORCE_EVENT_INT_STAT_CURR_LIMIT_POS)) /**< FORCE_EVENT_INT_STAT_CURR_LIMIT Mask */

#define MXC_F_SDHC_FORCE_EVENT_INT_STAT_AUTO_CMD_POS   8 /**< FORCE_EVENT_INT_STAT_AUTO_CMD Position */
#define MXC_F_SDHC_FORCE_EVENT_INT_STAT_AUTO_CMD       ((uint16_t)(0x1UL << MXC_F_SDHC_FORCE_EVENT_INT_STAT_AUTO_CMD_POS)) /**< FORCE_EVENT_INT_STAT_AUTO_CMD Mask */

#define MXC_F_SDHC_FORCE_EVENT_INT_STAT_ADMA_POS       9 /**< FORCE_EVENT_INT_STAT_ADMA Position */
#define MXC_F_SDHC_FORCE_EVENT_INT_STAT_ADMA           ((uint16_t)(0x1UL << MXC_F_SDHC_FORCE_EVENT_INT_STAT_ADMA_POS)) /**< FORCE_EVENT_INT_STAT_ADMA Mask */

#define MXC_F_SDHC_FORCE_EVENT_INT_STAT_STAT_VENDOR_POS 12 /**< FORCE_EVENT_INT_STAT_STAT_VENDOR Position */
#define MXC_F_SDHC_FORCE_EVENT_INT_STAT_STAT_VENDOR    ((uint16_t)(0xFUL << MXC_F_SDHC_FORCE_EVENT_INT_STAT_STAT_VENDOR_POS)) /**< FORCE_EVENT_INT_STAT_STAT_VENDOR Mask */

/**@} end of group SDHC_FORCE_EVENT_INT_STAT_Register */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_ADMA_ER SDHC_ADMA_ER
 * @brief    ADMA Error Status.
 * @{
 */
#define MXC_F_SDHC_ADMA_ER_STATE_POS                   0 /**< ADMA_ER_STATE Position */
#define MXC_F_SDHC_ADMA_ER_STATE                       ((uint8_t)(0x3UL << MXC_F_SDHC_ADMA_ER_STATE_POS)) /**< ADMA_ER_STATE Mask */

#define MXC_F_SDHC_ADMA_ER_LEN_MISMATCH_POS            2 /**< ADMA_ER_LEN_MISMATCH Position */
#define MXC_F_SDHC_ADMA_ER_LEN_MISMATCH                ((uint8_t)(0x1UL << MXC_F_SDHC_ADMA_ER_LEN_MISMATCH_POS)) /**< ADMA_ER_LEN_MISMATCH Mask */

/**@} end of group SDHC_ADMA_ER_Register */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_ADMA_ADDR_0 SDHC_ADMA_ADDR_0
 * @brief    ADMA System Address 0-31.
 * @{
 */
#define MXC_F_SDHC_ADMA_ADDR_0_ADDR_POS                0 /**< ADMA_ADDR_0_ADDR Position */
#define MXC_F_SDHC_ADMA_ADDR_0_ADDR                    ((uint32_t)(0xFFFFFFFFUL << MXC_F_SDHC_ADMA_ADDR_0_ADDR_POS)) /**< ADMA_ADDR_0_ADDR Mask */

/**@} end of group SDHC_ADMA_ADDR_0_Register */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_ADMA_ADDR_1 SDHC_ADMA_ADDR_1
 * @brief    ADMA System Address 32-63.
 * @{
 */
#define MXC_F_SDHC_ADMA_ADDR_1_ADDR_POS                0 /**< ADMA_ADDR_1_ADDR Position */
#define MXC_F_SDHC_ADMA_ADDR_1_ADDR                    ((uint32_t)(0xFFFFFFFFUL << MXC_F_SDHC_ADMA_ADDR_1_ADDR_POS)) /**< ADMA_ADDR_1_ADDR Mask */

/**@} end of group SDHC_ADMA_ADDR_1_Register */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_PRESET_0 SDHC_PRESET_0
 * @brief    Preset Value for Initialization.
 * @{
 */
#define MXC_F_SDHC_PRESET_0_SDCLK_FREQ_POS             0 /**< PRESET_0_SDCLK_FREQ Position */
#define MXC_F_SDHC_PRESET_0_SDCLK_FREQ                 ((uint16_t)(0x3FFUL << MXC_F_SDHC_PRESET_0_SDCLK_FREQ_POS)) /**< PRESET_0_SDCLK_FREQ Mask */

#define MXC_F_SDHC_PRESET_0_CLK_GEN_POS                10 /**< PRESET_0_CLK_GEN Position */
#define MXC_F_SDHC_PRESET_0_CLK_GEN                    ((uint16_t)(0x1UL << MXC_F_SDHC_PRESET_0_CLK_GEN_POS)) /**< PRESET_0_CLK_GEN Mask */

#define MXC_F_SDHC_PRESET_0_DRIVER_STRENGTH_POS        14 /**< PRESET_0_DRIVER_STRENGTH Position */
#define MXC_F_SDHC_PRESET_0_DRIVER_STRENGTH            ((uint16_t)(0x3UL << MXC_F_SDHC_PRESET_0_DRIVER_STRENGTH_POS)) /**< PRESET_0_DRIVER_STRENGTH Mask */
#define MXC_V_SDHC_PRESET_0_DRIVER_STRENGTH_TYPEB      ((uint16_t)0x0UL) /**< PRESET_0_DRIVER_STRENGTH_TYPEB Value */
#define MXC_S_SDHC_PRESET_0_DRIVER_STRENGTH_TYPEB      (MXC_V_SDHC_PRESET_0_DRIVER_STRENGTH_TYPEB << MXC_F_SDHC_PRESET_0_DRIVER_STRENGTH_POS) /**< PRESET_0_DRIVER_STRENGTH_TYPEB Setting */
#define MXC_V_SDHC_PRESET_0_DRIVER_STRENGTH_TYPEA      ((uint16_t)0x1UL) /**< PRESET_0_DRIVER_STRENGTH_TYPEA Value */
#define MXC_S_SDHC_PRESET_0_DRIVER_STRENGTH_TYPEA      (MXC_V_SDHC_PRESET_0_DRIVER_STRENGTH_TYPEA << MXC_F_SDHC_PRESET_0_DRIVER_STRENGTH_POS) /**< PRESET_0_DRIVER_STRENGTH_TYPEA Setting */
#define MXC_V_SDHC_PRESET_0_DRIVER_STRENGTH_TYPEC      ((uint16_t)0x2UL) /**< PRESET_0_DRIVER_STRENGTH_TYPEC Value */
#define MXC_S_SDHC_PRESET_0_DRIVER_STRENGTH_TYPEC      (MXC_V_SDHC_PRESET_0_DRIVER_STRENGTH_TYPEC << MXC_F_SDHC_PRESET_0_DRIVER_STRENGTH_POS) /**< PRESET_0_DRIVER_STRENGTH_TYPEC Setting */
#define MXC_V_SDHC_PRESET_0_DRIVER_STRENGTH_TYPED      ((uint16_t)0x3UL) /**< PRESET_0_DRIVER_STRENGTH_TYPED Value */
#define MXC_S_SDHC_PRESET_0_DRIVER_STRENGTH_TYPED      (MXC_V_SDHC_PRESET_0_DRIVER_STRENGTH_TYPED << MXC_F_SDHC_PRESET_0_DRIVER_STRENGTH_POS) /**< PRESET_0_DRIVER_STRENGTH_TYPED Setting */

/**@} end of group SDHC_PRESET_0_Register */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_PRESET_1 SDHC_PRESET_1
 * @brief    Preset Value for Default Speed.
 * @{
 */
#define MXC_F_SDHC_PRESET_1_SDCLK_FREQ_POS             0 /**< PRESET_1_SDCLK_FREQ Position */
#define MXC_F_SDHC_PRESET_1_SDCLK_FREQ                 ((uint16_t)(0x3FFUL << MXC_F_SDHC_PRESET_1_SDCLK_FREQ_POS)) /**< PRESET_1_SDCLK_FREQ Mask */

#define MXC_F_SDHC_PRESET_1_CLK_GEN_POS                10 /**< PRESET_1_CLK_GEN Position */
#define MXC_F_SDHC_PRESET_1_CLK_GEN                    ((uint16_t)(0x1UL << MXC_F_SDHC_PRESET_1_CLK_GEN_POS)) /**< PRESET_1_CLK_GEN Mask */

#define MXC_F_SDHC_PRESET_1_DRIVER_STRENGTH_POS        14 /**< PRESET_1_DRIVER_STRENGTH Position */
#define MXC_F_SDHC_PRESET_1_DRIVER_STRENGTH            ((uint16_t)(0x3UL << MXC_F_SDHC_PRESET_1_DRIVER_STRENGTH_POS)) /**< PRESET_1_DRIVER_STRENGTH Mask */
#define MXC_V_SDHC_PRESET_1_DRIVER_STRENGTH_TYPEB      ((uint16_t)0x0UL) /**< PRESET_1_DRIVER_STRENGTH_TYPEB Value */
#define MXC_S_SDHC_PRESET_1_DRIVER_STRENGTH_TYPEB      (MXC_V_SDHC_PRESET_1_DRIVER_STRENGTH_TYPEB << MXC_F_SDHC_PRESET_1_DRIVER_STRENGTH_POS) /**< PRESET_1_DRIVER_STRENGTH_TYPEB Setting */
#define MXC_V_SDHC_PRESET_1_DRIVER_STRENGTH_TYPEA      ((uint16_t)0x1UL) /**< PRESET_1_DRIVER_STRENGTH_TYPEA Value */
#define MXC_S_SDHC_PRESET_1_DRIVER_STRENGTH_TYPEA      (MXC_V_SDHC_PRESET_1_DRIVER_STRENGTH_TYPEA << MXC_F_SDHC_PRESET_1_DRIVER_STRENGTH_POS) /**< PRESET_1_DRIVER_STRENGTH_TYPEA Setting */
#define MXC_V_SDHC_PRESET_1_DRIVER_STRENGTH_TYPEC      ((uint16_t)0x2UL) /**< PRESET_1_DRIVER_STRENGTH_TYPEC Value */
#define MXC_S_SDHC_PRESET_1_DRIVER_STRENGTH_TYPEC      (MXC_V_SDHC_PRESET_1_DRIVER_STRENGTH_TYPEC << MXC_F_SDHC_PRESET_1_DRIVER_STRENGTH_POS) /**< PRESET_1_DRIVER_STRENGTH_TYPEC Setting */
#define MXC_V_SDHC_PRESET_1_DRIVER_STRENGTH_TYPED      ((uint16_t)0x3UL) /**< PRESET_1_DRIVER_STRENGTH_TYPED Value */
#define MXC_S_SDHC_PRESET_1_DRIVER_STRENGTH_TYPED      (MXC_V_SDHC_PRESET_1_DRIVER_STRENGTH_TYPED << MXC_F_SDHC_PRESET_1_DRIVER_STRENGTH_POS) /**< PRESET_1_DRIVER_STRENGTH_TYPED Setting */

/**@} end of group SDHC_PRESET_1_Register */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_PRESET_2 SDHC_PRESET_2
 * @brief    Preset Value for High Speed.
 * @{
 */
#define MXC_F_SDHC_PRESET_2_SDCLK_FREQ_POS             0 /**< PRESET_2_SDCLK_FREQ Position */
#define MXC_F_SDHC_PRESET_2_SDCLK_FREQ                 ((uint16_t)(0x3FFUL << MXC_F_SDHC_PRESET_2_SDCLK_FREQ_POS)) /**< PRESET_2_SDCLK_FREQ Mask */

#define MXC_F_SDHC_PRESET_2_CLK_GEN_POS                10 /**< PRESET_2_CLK_GEN Position */
#define MXC_F_SDHC_PRESET_2_CLK_GEN                    ((uint16_t)(0x1UL << MXC_F_SDHC_PRESET_2_CLK_GEN_POS)) /**< PRESET_2_CLK_GEN Mask */

