analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/sdhc_regs.h
#define MXC_F_SDHC_PRESET_2_DRIVER_STRENGTH_POS        14 /**< PRESET_2_DRIVER_STRENGTH Position */
#define MXC_F_SDHC_PRESET_2_DRIVER_STRENGTH            ((uint16_t)(0x3UL << MXC_F_SDHC_PRESET_2_DRIVER_STRENGTH_POS)) /**< PRESET_2_DRIVER_STRENGTH Mask */
#define MXC_V_SDHC_PRESET_2_DRIVER_STRENGTH_TYPEB      ((uint16_t)0x0UL) /**< PRESET_2_DRIVER_STRENGTH_TYPEB Value */
#define MXC_S_SDHC_PRESET_2_DRIVER_STRENGTH_TYPEB      (MXC_V_SDHC_PRESET_2_DRIVER_STRENGTH_TYPEB << MXC_F_SDHC_PRESET_2_DRIVER_STRENGTH_POS) /**< PRESET_2_DRIVER_STRENGTH_TYPEB Setting */
#define MXC_V_SDHC_PRESET_2_DRIVER_STRENGTH_TYPEA      ((uint16_t)0x1UL) /**< PRESET_2_DRIVER_STRENGTH_TYPEA Value */
#define MXC_S_SDHC_PRESET_2_DRIVER_STRENGTH_TYPEA      (MXC_V_SDHC_PRESET_2_DRIVER_STRENGTH_TYPEA << MXC_F_SDHC_PRESET_2_DRIVER_STRENGTH_POS) /**< PRESET_2_DRIVER_STRENGTH_TYPEA Setting */
#define MXC_V_SDHC_PRESET_2_DRIVER_STRENGTH_TYPEC      ((uint16_t)0x2UL) /**< PRESET_2_DRIVER_STRENGTH_TYPEC Value */
#define MXC_S_SDHC_PRESET_2_DRIVER_STRENGTH_TYPEC      (MXC_V_SDHC_PRESET_2_DRIVER_STRENGTH_TYPEC << MXC_F_SDHC_PRESET_2_DRIVER_STRENGTH_POS) /**< PRESET_2_DRIVER_STRENGTH_TYPEC Setting */
#define MXC_V_SDHC_PRESET_2_DRIVER_STRENGTH_TYPED      ((uint16_t)0x3UL) /**< PRESET_2_DRIVER_STRENGTH_TYPED Value */
#define MXC_S_SDHC_PRESET_2_DRIVER_STRENGTH_TYPED      (MXC_V_SDHC_PRESET_2_DRIVER_STRENGTH_TYPED << MXC_F_SDHC_PRESET_2_DRIVER_STRENGTH_POS) /**< PRESET_2_DRIVER_STRENGTH_TYPED Setting */

/**@} end of group SDHC_PRESET_2_Register */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_PRESET_3 SDHC_PRESET_3
 * @brief    Preset Value for SDR12.
 * @{
 */
#define MXC_F_SDHC_PRESET_3_SDCLK_FREQ_POS             0 /**< PRESET_3_SDCLK_FREQ Position */
#define MXC_F_SDHC_PRESET_3_SDCLK_FREQ                 ((uint16_t)(0x3FFUL << MXC_F_SDHC_PRESET_3_SDCLK_FREQ_POS)) /**< PRESET_3_SDCLK_FREQ Mask */

#define MXC_F_SDHC_PRESET_3_CLK_GEN_POS                10 /**< PRESET_3_CLK_GEN Position */
#define MXC_F_SDHC_PRESET_3_CLK_GEN                    ((uint16_t)(0x1UL << MXC_F_SDHC_PRESET_3_CLK_GEN_POS)) /**< PRESET_3_CLK_GEN Mask */

#define MXC_F_SDHC_PRESET_3_DRIVER_STRENGTH_POS        14 /**< PRESET_3_DRIVER_STRENGTH Position */
#define MXC_F_SDHC_PRESET_3_DRIVER_STRENGTH            ((uint16_t)(0x3UL << MXC_F_SDHC_PRESET_3_DRIVER_STRENGTH_POS)) /**< PRESET_3_DRIVER_STRENGTH Mask */
#define MXC_V_SDHC_PRESET_3_DRIVER_STRENGTH_TYPEB      ((uint16_t)0x0UL) /**< PRESET_3_DRIVER_STRENGTH_TYPEB Value */
#define MXC_S_SDHC_PRESET_3_DRIVER_STRENGTH_TYPEB      (MXC_V_SDHC_PRESET_3_DRIVER_STRENGTH_TYPEB << MXC_F_SDHC_PRESET_3_DRIVER_STRENGTH_POS) /**< PRESET_3_DRIVER_STRENGTH_TYPEB Setting */
#define MXC_V_SDHC_PRESET_3_DRIVER_STRENGTH_TYPEA      ((uint16_t)0x1UL) /**< PRESET_3_DRIVER_STRENGTH_TYPEA Value */
#define MXC_S_SDHC_PRESET_3_DRIVER_STRENGTH_TYPEA      (MXC_V_SDHC_PRESET_3_DRIVER_STRENGTH_TYPEA << MXC_F_SDHC_PRESET_3_DRIVER_STRENGTH_POS) /**< PRESET_3_DRIVER_STRENGTH_TYPEA Setting */
#define MXC_V_SDHC_PRESET_3_DRIVER_STRENGTH_TYPEC      ((uint16_t)0x2UL) /**< PRESET_3_DRIVER_STRENGTH_TYPEC Value */
#define MXC_S_SDHC_PRESET_3_DRIVER_STRENGTH_TYPEC      (MXC_V_SDHC_PRESET_3_DRIVER_STRENGTH_TYPEC << MXC_F_SDHC_PRESET_3_DRIVER_STRENGTH_POS) /**< PRESET_3_DRIVER_STRENGTH_TYPEC Setting */
#define MXC_V_SDHC_PRESET_3_DRIVER_STRENGTH_TYPED      ((uint16_t)0x3UL) /**< PRESET_3_DRIVER_STRENGTH_TYPED Value */
#define MXC_S_SDHC_PRESET_3_DRIVER_STRENGTH_TYPED      (MXC_V_SDHC_PRESET_3_DRIVER_STRENGTH_TYPED << MXC_F_SDHC_PRESET_3_DRIVER_STRENGTH_POS) /**< PRESET_3_DRIVER_STRENGTH_TYPED Setting */

/**@} end of group SDHC_PRESET_3_Register */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_PRESET_4 SDHC_PRESET_4
 * @brief    Preset Value for SDR25.
 * @{
 */
#define MXC_F_SDHC_PRESET_4_SDCLK_FREQ_POS             0 /**< PRESET_4_SDCLK_FREQ Position */
#define MXC_F_SDHC_PRESET_4_SDCLK_FREQ                 ((uint16_t)(0x3FFUL << MXC_F_SDHC_PRESET_4_SDCLK_FREQ_POS)) /**< PRESET_4_SDCLK_FREQ Mask */

#define MXC_F_SDHC_PRESET_4_CLK_GEN_POS                10 /**< PRESET_4_CLK_GEN Position */
#define MXC_F_SDHC_PRESET_4_CLK_GEN                    ((uint16_t)(0x1UL << MXC_F_SDHC_PRESET_4_CLK_GEN_POS)) /**< PRESET_4_CLK_GEN Mask */

#define MXC_F_SDHC_PRESET_4_DRIVER_STRENGTH_POS        14 /**< PRESET_4_DRIVER_STRENGTH Position */
#define MXC_F_SDHC_PRESET_4_DRIVER_STRENGTH            ((uint16_t)(0x3UL << MXC_F_SDHC_PRESET_4_DRIVER_STRENGTH_POS)) /**< PRESET_4_DRIVER_STRENGTH Mask */
#define MXC_V_SDHC_PRESET_4_DRIVER_STRENGTH_TYPEB      ((uint16_t)0x0UL) /**< PRESET_4_DRIVER_STRENGTH_TYPEB Value */
#define MXC_S_SDHC_PRESET_4_DRIVER_STRENGTH_TYPEB      (MXC_V_SDHC_PRESET_4_DRIVER_STRENGTH_TYPEB << MXC_F_SDHC_PRESET_4_DRIVER_STRENGTH_POS) /**< PRESET_4_DRIVER_STRENGTH_TYPEB Setting */
#define MXC_V_SDHC_PRESET_4_DRIVER_STRENGTH_TYPEA      ((uint16_t)0x1UL) /**< PRESET_4_DRIVER_STRENGTH_TYPEA Value */
#define MXC_S_SDHC_PRESET_4_DRIVER_STRENGTH_TYPEA      (MXC_V_SDHC_PRESET_4_DRIVER_STRENGTH_TYPEA << MXC_F_SDHC_PRESET_4_DRIVER_STRENGTH_POS) /**< PRESET_4_DRIVER_STRENGTH_TYPEA Setting */
#define MXC_V_SDHC_PRESET_4_DRIVER_STRENGTH_TYPEC      ((uint16_t)0x2UL) /**< PRESET_4_DRIVER_STRENGTH_TYPEC Value */
#define MXC_S_SDHC_PRESET_4_DRIVER_STRENGTH_TYPEC      (MXC_V_SDHC_PRESET_4_DRIVER_STRENGTH_TYPEC << MXC_F_SDHC_PRESET_4_DRIVER_STRENGTH_POS) /**< PRESET_4_DRIVER_STRENGTH_TYPEC Setting */
#define MXC_V_SDHC_PRESET_4_DRIVER_STRENGTH_TYPED      ((uint16_t)0x3UL) /**< PRESET_4_DRIVER_STRENGTH_TYPED Value */
#define MXC_S_SDHC_PRESET_4_DRIVER_STRENGTH_TYPED      (MXC_V_SDHC_PRESET_4_DRIVER_STRENGTH_TYPED << MXC_F_SDHC_PRESET_4_DRIVER_STRENGTH_POS) /**< PRESET_4_DRIVER_STRENGTH_TYPED Setting */

/**@} end of group SDHC_PRESET_4_Register */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_PRESET_5 SDHC_PRESET_5
 * @brief    Preset Value for SDR50.
 * @{
 */
#define MXC_F_SDHC_PRESET_5_SDCLK_FREQ_POS             0 /**< PRESET_5_SDCLK_FREQ Position */
#define MXC_F_SDHC_PRESET_5_SDCLK_FREQ                 ((uint16_t)(0x3FFUL << MXC_F_SDHC_PRESET_5_SDCLK_FREQ_POS)) /**< PRESET_5_SDCLK_FREQ Mask */

#define MXC_F_SDHC_PRESET_5_CLK_GEN_POS                10 /**< PRESET_5_CLK_GEN Position */
#define MXC_F_SDHC_PRESET_5_CLK_GEN                    ((uint16_t)(0x1UL << MXC_F_SDHC_PRESET_5_CLK_GEN_POS)) /**< PRESET_5_CLK_GEN Mask */

