analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32650/Include/sdhc_regs.h
#define MXC_F_SDHC_PRESET_5_DRIVER_STRENGTH_POS        14 /**< PRESET_5_DRIVER_STRENGTH Position */
#define MXC_F_SDHC_PRESET_5_DRIVER_STRENGTH            ((uint16_t)(0x3UL << MXC_F_SDHC_PRESET_5_DRIVER_STRENGTH_POS)) /**< PRESET_5_DRIVER_STRENGTH Mask */
#define MXC_V_SDHC_PRESET_5_DRIVER_STRENGTH_TYPEB      ((uint16_t)0x0UL) /**< PRESET_5_DRIVER_STRENGTH_TYPEB Value */
#define MXC_S_SDHC_PRESET_5_DRIVER_STRENGTH_TYPEB      (MXC_V_SDHC_PRESET_5_DRIVER_STRENGTH_TYPEB << MXC_F_SDHC_PRESET_5_DRIVER_STRENGTH_POS) /**< PRESET_5_DRIVER_STRENGTH_TYPEB Setting */
#define MXC_V_SDHC_PRESET_5_DRIVER_STRENGTH_TYPEA      ((uint16_t)0x1UL) /**< PRESET_5_DRIVER_STRENGTH_TYPEA Value */
#define MXC_S_SDHC_PRESET_5_DRIVER_STRENGTH_TYPEA      (MXC_V_SDHC_PRESET_5_DRIVER_STRENGTH_TYPEA << MXC_F_SDHC_PRESET_5_DRIVER_STRENGTH_POS) /**< PRESET_5_DRIVER_STRENGTH_TYPEA Setting */
#define MXC_V_SDHC_PRESET_5_DRIVER_STRENGTH_TYPEC      ((uint16_t)0x2UL) /**< PRESET_5_DRIVER_STRENGTH_TYPEC Value */
#define MXC_S_SDHC_PRESET_5_DRIVER_STRENGTH_TYPEC      (MXC_V_SDHC_PRESET_5_DRIVER_STRENGTH_TYPEC << MXC_F_SDHC_PRESET_5_DRIVER_STRENGTH_POS) /**< PRESET_5_DRIVER_STRENGTH_TYPEC Setting */
#define MXC_V_SDHC_PRESET_5_DRIVER_STRENGTH_TYPED      ((uint16_t)0x3UL) /**< PRESET_5_DRIVER_STRENGTH_TYPED Value */
#define MXC_S_SDHC_PRESET_5_DRIVER_STRENGTH_TYPED      (MXC_V_SDHC_PRESET_5_DRIVER_STRENGTH_TYPED << MXC_F_SDHC_PRESET_5_DRIVER_STRENGTH_POS) /**< PRESET_5_DRIVER_STRENGTH_TYPED Setting */

/**@} end of group SDHC_PRESET_5_Register */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_PRESET_6 SDHC_PRESET_6
 * @brief    Preset Value for SDR104.
 * @{
 */
#define MXC_F_SDHC_PRESET_6_SDCLK_FREQ_POS             0 /**< PRESET_6_SDCLK_FREQ Position */
#define MXC_F_SDHC_PRESET_6_SDCLK_FREQ                 ((uint16_t)(0x3FFUL << MXC_F_SDHC_PRESET_6_SDCLK_FREQ_POS)) /**< PRESET_6_SDCLK_FREQ Mask */

#define MXC_F_SDHC_PRESET_6_CLK_GEN_POS                10 /**< PRESET_6_CLK_GEN Position */
#define MXC_F_SDHC_PRESET_6_CLK_GEN                    ((uint16_t)(0x1UL << MXC_F_SDHC_PRESET_6_CLK_GEN_POS)) /**< PRESET_6_CLK_GEN Mask */

#define MXC_F_SDHC_PRESET_6_DRIVER_STRENGTH_POS        14 /**< PRESET_6_DRIVER_STRENGTH Position */
#define MXC_F_SDHC_PRESET_6_DRIVER_STRENGTH            ((uint16_t)(0x3UL << MXC_F_SDHC_PRESET_6_DRIVER_STRENGTH_POS)) /**< PRESET_6_DRIVER_STRENGTH Mask */
#define MXC_V_SDHC_PRESET_6_DRIVER_STRENGTH_TYPEB      ((uint16_t)0x0UL) /**< PRESET_6_DRIVER_STRENGTH_TYPEB Value */
#define MXC_S_SDHC_PRESET_6_DRIVER_STRENGTH_TYPEB      (MXC_V_SDHC_PRESET_6_DRIVER_STRENGTH_TYPEB << MXC_F_SDHC_PRESET_6_DRIVER_STRENGTH_POS) /**< PRESET_6_DRIVER_STRENGTH_TYPEB Setting */
#define MXC_V_SDHC_PRESET_6_DRIVER_STRENGTH_TYPEA      ((uint16_t)0x1UL) /**< PRESET_6_DRIVER_STRENGTH_TYPEA Value */
#define MXC_S_SDHC_PRESET_6_DRIVER_STRENGTH_TYPEA      (MXC_V_SDHC_PRESET_6_DRIVER_STRENGTH_TYPEA << MXC_F_SDHC_PRESET_6_DRIVER_STRENGTH_POS) /**< PRESET_6_DRIVER_STRENGTH_TYPEA Setting */
#define MXC_V_SDHC_PRESET_6_DRIVER_STRENGTH_TYPEC      ((uint16_t)0x2UL) /**< PRESET_6_DRIVER_STRENGTH_TYPEC Value */
#define MXC_S_SDHC_PRESET_6_DRIVER_STRENGTH_TYPEC      (MXC_V_SDHC_PRESET_6_DRIVER_STRENGTH_TYPEC << MXC_F_SDHC_PRESET_6_DRIVER_STRENGTH_POS) /**< PRESET_6_DRIVER_STRENGTH_TYPEC Setting */
#define MXC_V_SDHC_PRESET_6_DRIVER_STRENGTH_TYPED      ((uint16_t)0x3UL) /**< PRESET_6_DRIVER_STRENGTH_TYPED Value */
#define MXC_S_SDHC_PRESET_6_DRIVER_STRENGTH_TYPED      (MXC_V_SDHC_PRESET_6_DRIVER_STRENGTH_TYPED << MXC_F_SDHC_PRESET_6_DRIVER_STRENGTH_POS) /**< PRESET_6_DRIVER_STRENGTH_TYPED Setting */

/**@} end of group SDHC_PRESET_6_Register */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_PRESET_7 SDHC_PRESET_7
 * @brief    Preset Value for DDR50.
 * @{
 */
#define MXC_F_SDHC_PRESET_7_SDCLK_FREQ_POS             0 /**< PRESET_7_SDCLK_FREQ Position */
#define MXC_F_SDHC_PRESET_7_SDCLK_FREQ                 ((uint16_t)(0x3FFUL << MXC_F_SDHC_PRESET_7_SDCLK_FREQ_POS)) /**< PRESET_7_SDCLK_FREQ Mask */

#define MXC_F_SDHC_PRESET_7_CLK_GEN_POS                10 /**< PRESET_7_CLK_GEN Position */
#define MXC_F_SDHC_PRESET_7_CLK_GEN                    ((uint16_t)(0x1UL << MXC_F_SDHC_PRESET_7_CLK_GEN_POS)) /**< PRESET_7_CLK_GEN Mask */

#define MXC_F_SDHC_PRESET_7_DRIVER_STRENGTH_POS        14 /**< PRESET_7_DRIVER_STRENGTH Position */
#define MXC_F_SDHC_PRESET_7_DRIVER_STRENGTH            ((uint16_t)(0x3UL << MXC_F_SDHC_PRESET_7_DRIVER_STRENGTH_POS)) /**< PRESET_7_DRIVER_STRENGTH Mask */
#define MXC_V_SDHC_PRESET_7_DRIVER_STRENGTH_TYPEB      ((uint16_t)0x0UL) /**< PRESET_7_DRIVER_STRENGTH_TYPEB Value */
#define MXC_S_SDHC_PRESET_7_DRIVER_STRENGTH_TYPEB      (MXC_V_SDHC_PRESET_7_DRIVER_STRENGTH_TYPEB << MXC_F_SDHC_PRESET_7_DRIVER_STRENGTH_POS) /**< PRESET_7_DRIVER_STRENGTH_TYPEB Setting */
#define MXC_V_SDHC_PRESET_7_DRIVER_STRENGTH_TYPEA      ((uint16_t)0x1UL) /**< PRESET_7_DRIVER_STRENGTH_TYPEA Value */
#define MXC_S_SDHC_PRESET_7_DRIVER_STRENGTH_TYPEA      (MXC_V_SDHC_PRESET_7_DRIVER_STRENGTH_TYPEA << MXC_F_SDHC_PRESET_7_DRIVER_STRENGTH_POS) /**< PRESET_7_DRIVER_STRENGTH_TYPEA Setting */
#define MXC_V_SDHC_PRESET_7_DRIVER_STRENGTH_TYPEC      ((uint16_t)0x2UL) /**< PRESET_7_DRIVER_STRENGTH_TYPEC Value */
#define MXC_S_SDHC_PRESET_7_DRIVER_STRENGTH_TYPEC      (MXC_V_SDHC_PRESET_7_DRIVER_STRENGTH_TYPEC << MXC_F_SDHC_PRESET_7_DRIVER_STRENGTH_POS) /**< PRESET_7_DRIVER_STRENGTH_TYPEC Setting */
#define MXC_V_SDHC_PRESET_7_DRIVER_STRENGTH_TYPED      ((uint16_t)0x3UL) /**< PRESET_7_DRIVER_STRENGTH_TYPED Value */
#define MXC_S_SDHC_PRESET_7_DRIVER_STRENGTH_TYPED      (MXC_V_SDHC_PRESET_7_DRIVER_STRENGTH_TYPED << MXC_F_SDHC_PRESET_7_DRIVER_STRENGTH_POS) /**< PRESET_7_DRIVER_STRENGTH_TYPED Setting */

/**@} end of group SDHC_PRESET_7_Register */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_SLOT_INT SDHC_SLOT_INT
 * @brief    Slot Interrupt Status.
 * @{
 */
#define MXC_F_SDHC_SLOT_INT_INT_SIGNALS_POS            0 /**< SLOT_INT_INT_SIGNALS Position */
#define MXC_F_SDHC_SLOT_INT_INT_SIGNALS                ((uint16_t)(0x1UL << MXC_F_SDHC_SLOT_INT_INT_SIGNALS_POS)) /**< SLOT_INT_INT_SIGNALS Mask */

/**@} end of group SDHC_SLOT_INT_Register */

/**
 * @ingroup  sdhc_registers
 * @defgroup SDHC_HOST_CN_VER SDHC_HOST_CN_VER
 * @brief    Host Controller Version.
 * @{
 */
#define MXC_F_SDHC_HOST_CN_VER_SPEC_VER_POS            0 /**< HOST_CN_VER_SPEC_VER Position */
#define MXC_F_SDHC_HOST_CN_VER_SPEC_VER                ((uint16_t)(0xFFUL << MXC_F_SDHC_HOST_CN_VER_SPEC_VER_POS)) /**< HOST_CN_VER_SPEC_VER Mask */

#define MXC_F_SDHC_HOST_CN_VER_VEND_VER_POS            8 /**< HOST_CN_VER_VEND_VER Position */
#define MXC_F_SDHC_HOST_CN_VER_VEND_VER                ((uint16_t)(0xFFUL << MXC_F_SDHC_HOST_CN_VER_VEND_VER_POS)) /**< HOST_CN_VER_VEND_VER Mask */

/**@} end of group SDHC_HOST_CN_VER_Register */

#ifdef __cplusplus
}
#endif

#endif // LIBRARIES_CMSIS_DEVICE_MAXIM_MAX32650_INCLUDE_SDHC_REGS_H_
